{"overall":5,"vote":"2","verified":false,"reviewTime":"11 27, 2013","reviewerID":"A3NHUQ33CFH3VM","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Greeny","reviewText":"Not one thing in this book seemed an obvious original thought. However, the clarity with which this author explains how innovation happens is remarkable.\n\nAlan Gregerman discusses the meaning of human interactions and the kinds of situations that tend to inspire original and\/or clear thinking that leads to innovation. These things include how people communicate in certain situations such as when they are outside of their normal patterns.\n\nGregerman identifies the ingredients that make innovation more likely. This includes people being compelled to interact when they normally wouldn't, leading to serendipity. Sometimes the phenomenon will occur through collaboration, and sometimes by chance such as when an individual is away from home on travel.\n\nI recommend this book for its common sense, its truth and the apparent mastery of the subject by the author.","summary":"Clear on what leads to innovation","unixReviewTime":1385510400,"image":null}
{"overall":3,"vote":null,"verified":false,"reviewTime":"12 27, 2013","reviewerID":"A2RQ0AT4XZUIXL","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Dr. Cathy Goodwin","reviewText":"In  this engaging, readable book, author Gregrerman argues that business and personal growth come when we are open to interacting with strangers. This advice isn't especially new; as the author notes, Granovetter's concept of \"weak ties\" has become familiar. However much I wanted to like this book, I found it hard to identify insights that were truly new and novel and the recommendations, in some cases, impractical.\n\nFor instance, on page 26, the author suggests tips to create a plan for success. It's pretty standard: set an objective, develop a plan and so on. One step, \"Find strangers to fill those [knowledge] gaps,\" makes a lot of sense; it's the essential premise of networking. But these days, getting strangers to share information requires fairly sophisticated networking skills.\n\nWhile the book's premise relates to the importance of strangers, a good part of content is about overcoming resistance to people who might seem to have nothing to teach us. The issue here doesn't seem to be about strangers but about topics related to stereotyping and false appearance. It's important to differentiate true strangers from those we meet in a familiar setting that confers credibility.\n\nAdditionally, the people who gain most from dealing with strangers tend to transform the relationship so they're now dealing with friends and personal acquaintances. The stranger factor disappears! For instance, the author describes a meeting with a university administrator who becomes a mentor and advocate. Although the two were strangers initially, they met in a fairly structured situation that was conducive to creating a relationship, and at some early point they stopped being strangers\n\nPerhaps our real challenge is not about breaking down barriers with strangers, but deciding which strangers to approach and how to assess their input. Career changers are urged to seek help from experts in their industry, yet often the \"advice\" they get is inappropriate; however, these people can be valuable as informational resources when approached with carefully designed questions.\n\nIn the end, the stranger question becomes both simple and complex. Yes, we will grow by interacting with diverse people who are outside our inner circles. However, sometimes resistance to strangers can help us avoid traps, especially when we're paying or placing ourselves in a vulnerable position.\n\nFor instance, the author says he met his wife by connecting with strangers in a particularly clever way - offering a big reward to friends who'd set up an introduction. Sure, these women were strangers, but they were already connected through his own friends, creating an effective filter.\n\nThe toolkit at the book's end includes some useful but not entirely novel ideas. In my experience the best way to meet new people in a meaningful is to engage in some new activity. His idea to \"get out of the office\" is a good start, but what about joining a new gym or a new club, trying new networking events, or even taking a class that brings you in contact with people you wouldn't meet otherwise?\n\nOverall the book entertains.  You might have some interesting conversations and talking points when you share the examples But the title leads us to expect something that radically shifts our mindset ... sort of like what happens when we connect with strangers.","summary":"Good topic, very entertaining, not truly new and novel","unixReviewTime":1388102400,"image":null}
{"overall":5,"vote":"5","verified":true,"reviewTime":"12 24, 2013","reviewerID":"ALZ2S4839OZUQ","asin":"1118461304","style":{"Format:":" Kindle Edition"},"reviewerName":"Darrell A. Kammer M.D.","reviewText":"Very thought provoking. Hits the nail on the head when I look at my own experiences with strangers on airlines, etc. Most of these encounters have been very educational giving me insights I would never have realized. I work with a non-profit organization that continues to benefit from international exposure resulting from a meeting with a reporter while on an airliner.  I would strongly recommend this book to anyone. The fact that I depend on reviews, like this one, to help with my purchases makes his point!\nD.Kammer","summary":"Best recent book purchase!!","unixReviewTime":1387843200,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"12 18, 2013","reviewerID":"A1INE33UQ1B4Q3","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"booktalk29","reviewText":"The insights this book provides are remarkable -- Gregerman delivers actionable advice concisely with a clear, even playful prose. His observations on the importance of spontaneity are thought-provoking and remind me of other books like \"Anti-Fragile.\"\n\nOverall, a short but information-packed read! Definitely recommend.","summary":"Fantastic Ideas!","unixReviewTime":1387324800,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"12 14, 2013","reviewerID":"A1H6JP5UC5WVT7","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Edward G.","reviewText":"When I first read through The Necessity of Strangers, it seemed to tell the same old stories about innovation that you see told over and over again. Yet another consultant out there making money telling clients to do this and do that to improve their business, where almost any action will help. Not much unique or valuable about those kinds of consultants.\n\nSo after skimming a few chapters I put the book on my unread books pile for a while and moved on to other books. When I picked the book up later, though, I was more impressed. I tried some of the practical suggestions Alan Gregerman gives at the end of his chapters, and they seemed to work. They were more than just gimmicks, but helpful tools.\n\nThat said, I'm still not sure which book most readers will experience. The trite rehash or the helpful guidance. Perhaps it's worth reading the book to find out.","summary":"My feelings about this book are mixed","unixReviewTime":1386979200,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"12 10, 2013","reviewerID":"AHUT55E980RDR","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Neal Reynolds","reviewText":"As children, we were all warned against strangers.  Some of us carried that feat and distrust of people we haven't been introduced to into adulthood.  As business people, this fear and distrust now works against us.  We need to be more open to what we hear from all sources.\n\nWell, Alan Gregeman himself is a stranger to me, but he sure makes sense in his book.  Our friends make up an insignificant percentage of the world's poulation so closing our ears to strangers is closing ourselves to most of the world.\n\nThis book makes lots of sense.  Gregeman in a conversational, rather than academic, tone illustrates the value these \"strangers\" hold for us.\n\nThis is a book that will open your eyes, ears, and heart to new perspectives and perceptions.  This is a book for all of us and although I'm a stranger to most of you, heed my advice and read this book.  Trust me.","summary":"Splendid advice","unixReviewTime":1386633600,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"12 7, 2013","reviewerID":"A1DGVGJ55SB5PV","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Mara","reviewText":"Dr. Gregerman presents an important message for leaders in a range of organizations in an entertaining, motivating format. He forces the reader to challenge basic assumptions about how we develop networks and how to prioritize relationships. It's a great read for those interested in topics from change management to innovation.","summary":"Challenging assumptions","unixReviewTime":1386374400,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"12 7, 2013","reviewerID":"A1F1A0QQP2XVH5","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Mark B","reviewText":"I like business books that approach topics and issues  (even if they are obvious topics and issues) from a new perspective.  This book specifically addresses the need for us to overcome our natural, built-in aversion to dealing with \"strangers.\"  The books spends a lot of time demonstrating that this aversion is something that is part of the human make-up, and then shows how this aversion hinders our innovation, creativity, collaboration,  and ability to lead.  I read two or three business books per month, and none of them have yet addressed this interesting point of view in quite this way.  It seems like an obvious point, but this book really made me think about how to engage with \"strangers\" and I actually now find myself seeking out others and engaging in better conversation.  At a conference I recently went to, I actually found myself making an effort to meet other vendors to learn more deeply about what they do.  When we do this, we expand our horizons, get out of our limited point of view, and can innovate and lead better.  So, I gave the book five stars for presenting a new approach to something \"obvious\" and making a difference in the way I approach business.  I knocked it one star for being way too lengthy in some places (a typical business book problem these days).  But I gave it one star back for providing a \"Toolkit\" at the end of the book to help the reader apply the principles presented throughout the book.  This is a great idea and I wish every business book did this.  So, did I learn something? Yes.  Is it something I can apply that will make a difference? Yes.  Did I find a few \"a-ha!\" moments and did I find myself highlighting and taking notes?  Yes.  This is a business book that I can highly recommend.","summary":"Good business book with a new perspective","unixReviewTime":1386374400,"image":null}
{"overall":3,"vote":null,"verified":false,"reviewTime":"12 5, 2013","reviewerID":"A2QKCOX5ACRHC5","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Jijnasu Forever","reviewText":"In a breezy, conversational book, Gregrerman implores the reader that a \"growth\" mindset predicted on recognizing the gaps in one's personal\/business plans and the willingness to reach out to strangers to learn from and fill that gap - is a dependable way to innovate\/grow.  For a book that is billed as \"counterintuitive\" and \"provocative\", that advise may seems fairly formulaic.  Nevertheless, the ample use of anecdotes and some personal experiences are used to illustrate some simple (to understand, at least) techniques that can reduce one's reluctance to reach out and collaborate with \"strangers\".  The message is elegant, simple, and can be quite useful - one wishes that the editing was a little stricter (with about 200 pages, the message is amplified many times in the book) and more careful in some of the recommendations (some brilliant ones related to orientation of new hires get mixed with not-so-great ones regarding promotions).  With ample references to other pop psych books on incentives, motivation and leadership, Gregerman provides a potentially powerful message to reframe one's approach on growth.","summary":"An elegant and simple message","unixReviewTime":1386201600,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"12 4, 2013","reviewerID":"A2SY92ZXU2FOEU","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"sanoe.net","reviewText":"I had zero expectations of Alan Gregerman's \"The Necessity of Strangers.\" In fact, I forgot that I got it until it arrived and I probably would have set it aside except that I read the book flap and was intrigued again.\n\nI'm a creature of habit but Gregerman's theorizes (successfully) that it isn't the team you know but perhaps the constructive team that you don't know that pushes individuals and businesses towards innovation.\n\nAfter reading this very concise and well laid out book, I'm inclined to agree when I think of my own work history. It was when there was a constant flow of 'strangers' that I stayed on my toes and my mind was sharp.\n\nBeing in the 'back' now, I'm not as exposed to clients, internal or external, so this book is actually very timely for me.\n\nGregerman organizes the book into 3 parts. The first is Framework that explains why we need 'strangers' and the second part is 'Practice' in how it can work and it makes up the bulk of the book. The final part is Possibilities which is almost superfluous compared to the previous parts but it was like a reward of sorts.\n\nVery well done.","summary":"Definitely something that I needed to read","unixReviewTime":1386115200,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"11 27, 2013","reviewerID":"A3MWXF2CLXHBRI","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Catherine Jo Morgan","reviewText":"For some reason I found it hard to get into this book, although I dipped into it here and there for a while. The basic premise -- that communicating with strangers is a key to new creative ideas -- seemed unarguable but -- so what? A whole book about it?\n\nWhen I read the last section, though, I found so many useful ideas that I was startled into real enthusiasm. I found ideas I could readily apply to my own one-person business, my church, and to my daughter's department in a large corporation. There are also suggestions for further reading that look very useful. So I'd definitely give this book a thumbs-up!","summary":"Some great ideas with wide applicability","unixReviewTime":1385510400,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"07 11, 2016","reviewerID":"APP8XWYYV4PAA","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"E-Commerce Maven","reviewText":"We need to collaborate to win. This does not mean that it is limited to those we know. This both is worth a read. Essential to every business.","summary":"Collaboration Again!","unixReviewTime":1468195200,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"05 12, 2014","reviewerID":"A1XMYM1OVUNCXX","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Steve Smith","reviewText":"Alan Gregerman has produced a book full of practical ideas about how to achieve personal success and business success. Big ideas like adopting a \"growth mindset\" and utilizing strangers to fill in knowledge gaps mingle with detailed examples like rethinking new employee orientation. This highly readable book will have you thinking in new ways about very fundamental issues but most importantly will provide you with tangible ideas that will make a difference. Highly recommended.","summary":"Very engaging style, big concepts and practical applications","unixReviewTime":1399852800,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"05 20, 2014","reviewerID":"A21MGW4YYUZ1YW","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"MichiganMama","reviewText":"This book caused me to challenge my assumptions about the value of input from people who cross my path every day in both business and my personal life.  The real growth opportunities are considering insights that are different from ours.  Great provocative book.","summary":"Challenge Assumptions About Our Interactions","unixReviewTime":1400544000,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"05 20, 2014","reviewerID":"A21CQSIOV4NG7Y","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Nikida Levy","reviewText":"In The Necessity of Strangers, Alan Gregman brings to life a simple concept that is generally overlooked. This novel makes a compelling argument for going out and meeting different people. What I enjoyed most about this book was that it gave readers a different view on hot to network and the importance of networking with people outside of your immediate circle. A very well written book and a must read for anyone interested ina change in perspective!","summary":"A very well written book that gives good insight on how to benefit from networking","unixReviewTime":1400544000,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"05 20, 2014","reviewerID":"A1O690F0T9XR4Z","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Shiri Brodsky","reviewText":"Dr. Alan Gregerman's book uses engaging stories and clear examples to depict his counterintuitive proposal that strangers hold the key to us reaching our full potential. I read this book as a requirement for a class of mine and found it to be enjoyable and thought-provoking. Also includes great strategies to developing innovative and creative capabilities for a successful career and life.","summary":"Great book, great theory","unixReviewTime":1400544000,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"07 18, 2014","reviewerID":"A2F8QSA7BCK1N6","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Jennifer Meder","reviewText":"I read this book when my company invited Mr. Gregerman to speak at a conference. The book (and his talk) were fantastic. I really enjoyed the stretch of thinking differently about the role strangers play in our work lives. I have been so attuned to this since reading the book and it has opened a number of doors for me, personally and professionally.\n\nHighly recommend!","summary":"The book (and his talk) were fantastic. I really enjoyed the stretch of thinking differently ...","unixReviewTime":1405641600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"08 5, 2014","reviewerID":"A34T20MDA599MA","asin":"1118461304","style":{"Format:":" Kindle Edition"},"reviewerName":"mano","reviewText":"Second book of his I've read, and as always, very intriguing look at viewing life thru new eyes.","summary":"Good to change your outlook","unixReviewTime":1407196800,"image":null}
{"overall":5,"vote":"2","verified":true,"reviewTime":"09 3, 2014","reviewerID":"A3C2VXXYG6ZB7J","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Stephanie Plunkett","reviewText":"LOVED this book!! conversational, funny and filled with many important life lessons :)","summary":"Five Stars","unixReviewTime":1409702400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"10 30, 2014","reviewerID":"A1A7PGN2HLMLOW","asin":"1118461304","style":{"Format:":" Kindle Edition"},"reviewerName":"Christiane D Wasfy","reviewText":"You can't miss any of Alan's books - mind refreshing, thought provoking and confirming your wish to be \"free\" to live your thoughts and dreams... Just do it !","summary":"You can't miss any of Alan's books - mind refreshing ...","unixReviewTime":1414627200,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"12 29, 2013","reviewerID":"AQCJWSMSURQI2","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"A Customer","reviewText":"With talk constantly of \"working your network\" and leveraging your friendships, we lose the importance of expanding our friendships beyond a comfort zone:  to strangers.  Strangers are intimidating, may not want to be engaged, but are valuable to expand your universe and world view.\n\nOnce I went to a conference (as a junior person) with some executives from my company.  The executives interacted with each other, and with some people who worked at another location for the same company.  I leveraged my contacts to meet others at the conference, and just downright introduced myself to people.  I was far better at solidifying new business contacts than people who had far more experience than I, only because I was more gregarious and wanted to meet others.\n\nGregerman expands on this concept very well, and points out the many advantages of dealing with \"new blood\" as opposed to the same old people.\n\nWell written with good examples, \"The Necessity of Strangers\" is an important book for someone looking to expand beyond their sphere and learn from, and teach, others.","summary":"\"A stranger is just a friend I haven't met yet\"","unixReviewTime":1388275200,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"12 29, 2013","reviewerID":"ABEAUXVVB2E1M","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Linda Armstrong","reviewText":"Author Alan Gregerman, ([...] a business consultant and adjunct professor at Georgetown University offers eight pages of additional resources at the end of his fascinating book, saying, \"..these books articles, and websites,,,have formed an essential part of the mix that became 'The Necessity of Strangers.' You might say that I started with a large pot and a simple idea, threw in some water, and a few stones, and then wandered around looking for ideas, insights, and perspectives from a world filled with strangers.\" As you can tell, he includes the authors of books, articles, and websites, as well as ordinary people he encounters in the course of performing the small and large duties of life, in his definition of stranger inspiration. His business audience (Jossey-Bass) is very familiar with the former. Coming out of MBA programs, they look for help from books and articles all the time. It is the latter source of fresh thinking that they may, apart from surveys and polls. ignore. He also points out the importance of the fact that in many interactions, the parties are strangers. Smart business people take this into consideration and make every effort to establish relevant common ground. This seems obvious, but it is a significantly different way of thinking about customer service, collaboration, personnel relations, technological change, innovation, and leadership. The book is well-written, well-organized, and peppered with interesting examples, but it mainly argues for a change in attitude, and if you are a bottom-line business type looking for a quick, ready-made prescription to solve your problems, you may be disappointed. There are no charts or graphs or results of studies. Instead the author offers a road map and directions to set you off on your own journey. If you accept his challenge, he will be the first of a legion of strangers who will transform the human landscape around you.","summary":"A New Way of Looking at the Sources of New Ideas","unixReviewTime":1388275200,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"08 19, 2016","reviewerID":"AWSLGG21FW7IU","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Jorge Alvarez","reviewText":"A compelling book about why we should not be afraid to ask for help from the strangers around us. Unexpected ideas can develop that enhance our talents.","summary":"Strangely Interesting","unixReviewTime":1471564800,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"01 6, 2014","reviewerID":"ASHO96ZB8AL1Z","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Lindsey W","reviewText":"As church leader, I'm often trying to find new and innovative ways to do things, and I'm fortunate enough to have a near constant stream of \"strangers\" come through the doors of the church each week.  I would love to learn how to utilize this opportunity more effectively.  This book does a great job demonstrating the power of working with strangers as well as giving some terrific practical advice about how to gather ideas and implement them.  A terrific book for leaders in any industry!","summary":"Really interesting, great for leaders!","unixReviewTime":1388966400,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"10 9, 2013","reviewerID":"A1HOG1PYCAE157","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Rebecca Ripley","reviewText":"Alan Gregerman is a smart, funny, entertaining writer who will jostle your point of view. Through every encounter with a stranger, Alan opens his mind and heart to new possibilities. His ability to spot meaningful connections and weave them into compelling stories allows us all to learn vicariously. His rich life experiences become our learning playground. I highly recommend this book and encourage you to share what you learn from strangers--as the result of your delightfully modified worldview.","summary":"Strangers are Your New Best Friends","unixReviewTime":1381276800,"image":null}
{"overall":5,"vote":"10","verified":false,"reviewTime":"09 7, 2013","reviewerID":"A26JGAM6GZMM4V","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Robert Morris","reviewText":"As I began to read this book, I was again reminded of how deceptively complicated the word \"stranger\" is. It could refer to someone we have never heard of, of course, but it could also refer to someone we have met or heard about. We know their name but nothing else about them. Then there is another type of \"stranger\": someone we think we know well but really don't. We have false assumptions, a mindset, about who they are and aren't, what they can and can't do, and whether or not they would be willing to provide or receive assistance.\n\nAlan Gregerman wrote this book to explain how and why - with all due respect to the importance of one's family members, friends, and associates -- it is imperative to engage, learn from, and collaborate with strangers. \"People who are very different from us are essential to our growth and success as individuals and organizations.\" Just as Henry Chesbrough has devised an open business model, it could be said that Gregerman offers an open people model. How so?\n\n\"Each day we pass by more than one hundred people that could change our lives but we never make the time or effort to connect. The best way to solve any challenge or create any new opportunity is to begin by being curious about the world around us and realize that it is filled with remarkable people, insights, and possibilities.\" Nonetheless, there are those false assumptions and, perhaps, at least some concern about being rejected and feeling embarrassed or even foolish.\n\nHe suggests a new paradigm individuals and organizations \"wise enough\" to incorporate exploration and openness in their DNA. Here's its formula:\n\nBusiness and Personal Success =\nWhat I Already Know +\nMy Knowledge or Understanding Gap +\nA Stranger (or Strangers) Who Can Fill It\n\nHis citation of one of my favorite Charles Kettering quotations is dead-on:\n\n\"Where there is an open mind there will always be a frontier.\"\n\nGregerman devotes a great deal of attention to explaining how to develop the necessary mindset, one that embraces rather than recoils from exploration and openness. There are four core principles that provide its foundation: humility, curiosity, respect, and purpose. For those who are especially reluctant to become explorers of what is -- for them -- not only unfamiliar but perhaps terrifying territory, I presume to suggest one other: the courage to which Jack Dempsey refers when explaining that \"champions get up when they can't.\"\n\nThese are among the passages that caught my eye:\n\no Questions that strangers can help to answer (Page 9)\no The Race to the South Pole (20-28)\no What Science Tells Us (30-39)\no From Mindset to Guiding Principles (51-56)\no Helicopters. Hairstyles and Cars That Won't Collide (64-73)\no Finding the Right Strangers (78-84)\no Recognizing the Genius in Everyone (89-93)\no Rethinking Employee Engagement (96-103)\no Why Collaborate? (110-118)\no The New World of Customers (131-134)\no Understanding and Empowering Strangers (138-143)\no The Promise of Strangers (152-155)\no Changing the Game (158-163\no Getting Past the First Bite (174-176)\no Essential Tools for Implementation (189-201)\n\nWhen concluding his book, Alan Gregerman acknowledges the difficulty while stressing the importance of \"taking the first step\" toward understanding the potential importance of strangers to us and (yes) our potential importance to them. He observes, \"As humans we have the amazing ability to be open and to dream, imagine, explore, learn, connect, share, collaborate, innovate, and grow, to go big instead of going home. So get out there and find the stranger or the [strange] idea that could change your life.\" Who knows? We may be that stranger or have that idea that someone else needs. Nothing ventured....","summary":"How and why it is imperative to engage, learn from, and collaborate with strangers","unixReviewTime":1378512000,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"05 11, 2014","reviewerID":"A17K8WANMYHTX2","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"mark h wellman","reviewText":"I teach a class on innovation and I used the Necessity of Strangers as one of the required books. The students loved the book. The book is an insightful piece of literature that turns the common knowledge of networking on its head. The main point of the book is that random strangers are able to be much more beneficial in the growth of a product or business, because strangers have outside perspectives without bias.\n\nI would highly recommend the book. Also, Mr. Gregerman is a wonderful public speaker!","summary":"Insightful & Very Useful!","unixReviewTime":1399766400,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"05 9, 2014","reviewerID":"A13IW3A6W43U0G","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Mmf","reviewText":"I so appreciated the insights and perspective this book.  Allen Gregerman organIzes and presents ideas beautifully - reminding us that seeing things in new ways is so very valuable.  So much about life encourages us to seek the known and comfortable and yet so infrequently is that where growth and progress is realized.\n\nThe writing style is wonderful. I've given copies of the book to my HR friends - and it has been very well received\n\nImagine if more organizations embraced this thinking!","summary":"The necessity of this book!","unixReviewTime":1399593600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"05 7, 2014","reviewerID":"A1ECEGG1MP7J8J","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"G. Deatherage","reviewText":"As with \"Surrounded by Genius\", Alan Gregerman brings simple ideas to create inspiration.  Never underestimate the human spirit and those around you to bring creativity and innovation to any challenge.  Alan has once again put a tool in our hands to invite us to look to those around us for solutions and guidance.","summary":"Great insight-Great book","unixReviewTime":1399420800,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"05 4, 2014","reviewerID":"A2D5X9G9S3A7RN","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Teresa Fritsch","reviewText":"Alan Gregermans book provides valuable ideas for leaders who are required to continually scan and look for new and better ways to engage their employees and customers and innovatively grow their business.  His stories and guidance empower leaders to take actions that lead to possibility while broadening connections.","summary":"The Necessity of Strangers dares you to be open and explore to realize personal and organizational growth.","unixReviewTime":1399161600,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"05 2, 2014","reviewerID":"AP2F86JFRQ205","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Ken Harris","reviewText":"I am a believer in Alan Gregerman.  I have enjoyed his blogs, lectures and books for several years.  Alan offers fun and practical guidance on not only getting the most out of our work, but out of our lives.\n\nAlan encourages us to get out of the comfort zone.  When faced with an urgent problem, most of us buckle down, bring in our closest advisors, lock the doors, order in dinner and make very important decisions.  Alan argues that we need to get out of the office, walk around and see what other great companies are doing.\n\nWhy?  In his latest offering, Alan reminds us the importance of strangers in our lives and the companies and organizations where we work.  In this Facebook world we live in, where many of us may have thousands of friends, Alan reminds us that friends can only get us so far..they are often reflections of ourselves.  While these might be comforting in a scary, for us to grow we must get out of the comfort zone in order to reach  our full potential?\n\nWe are a society that worships great ideas and often think that you must be brilliant like a Jobs or Zuckerberg.  Alan reminds us that most great ideas are borrowed from strangers and that the answers to our problem might be right and front of us.  He references  the Census, a process remained unchanged for nearly two centuries, and how it was improved by learning from our friends at UPS . That ITunes is merely a takeoff of The Great Library in Alexandria.  That most new drug discoveries are not being uncovered in isolated laboratories, but in faraway places that have treated these diseases for hundreds of years.\n\n99% of all ideas embrace the brilliance in the world around us. Curiosity. Humility. Respect.  While we all cannot be brilliant, we all can be curious, humble and respectful.  It is these arrows we need in quivers to reach our full potential,","summary":"Review: The Necessity of Strangers","unixReviewTime":1398988800,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"12 30, 2013","reviewerID":"A3ANAWYJOX02BE","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"WendyWoman","reviewText":"As a former job seeker 2 times over, I was told again and again to build my network and rely on that network of friends and close contacts to help me in my job search. It makes a lot of sense and it's what you're told again and again.\n\nMany job seekers in organizations I joined were on LinkedIn, but they didn't want to link to anyone that they did not know well enough that they would not give them a stellar recommendation. The thinking is, don't link in with anyone who might not have a stellar reputation or they might drag down your reputation. I can see that point, but if I met you at a networking event and you seem reasonably nice and helpful, why not link in with you? Why be so suspicious? If I make it clear to others in my network who might inquire about someone I'm linked with, why not be completely candid and say \"I met them in a networking event and they seemed nice, but I haven't worked with them before so I can't vouch for their work habits or reliability\". How often do you really get asked about someone in your LinkedIn network anyway?\n\nThis book served to encourage my more open-minded view of growing my network. I wouldn't link with someone I knew nothing about, but if you've met them and have a positive impression why not offer to help them?\n\nIt is important to know what this book defines as a \"stranger\" as you begin to read. Most of us think of strangers as someone we know nothing about. The author broadens this to include people we think we know well but really don't. Or someone we know very casually. I wouldn't categorize these types of people as \"strangers\" but I think it makes a better book title to say \"The Necessity of Strangers\" than \"The Necessity of Acquaintances and Strangers\". The latter title would be more accurate, but I guess it doesn't have the concise sizzle for selling books.\n\nThe book is an interesting concept. Opening yourself to insights and possibilities offered by people who have been raised in a different environment\/culture is a good idea. Even just listening to viewpoints from others could help you consider avenues you did not consider earlier and help lead to greater success in your personal and business life.\n\nAll in all, I consider this a good book. It encourages thinking beyond your immediate circles which is good encouragement for those of us who are New Englanders and tend to stick to our circles rather than venturing out and listening to new ideas.","summary":"Your best network may not be those you know best","unixReviewTime":1388361600,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"10 10, 2013","reviewerID":"A3SOFHUR27FO3K","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Harry Gilbert Miller III","reviewText":"Alan Gregerman believes that innovation comes from viewing problems from different and fresh perspectives.  In The Necessity of Strangers, he tells short, simple stories to help free us from current, legacy views of the problem at hand.  He then provides a toolbox containing practical exercises - to stretch our thinking, to collaborate more effectively, to find strangers - all focused on getting us to view problems from different perspectives.  The Necessity of Strangers is a quick read that I keep on the desk as a constant reminder to seek novel views from new sources.  Like matter to anti-matter, The Necessity of Strangers is the perfect and completing complement to his earlier Surrounded by Geniuses.  Gil Miller, Chief Technology Officer, Noblis","summary":"The World from Different Perspectives","unixReviewTime":1381363200,"image":null}
{"overall":4,"vote":"2","verified":true,"reviewTime":"04 11, 2014","reviewerID":"A3VF3A5A3O04E1","asin":"1118461304","style":{"Format:":" Kindle Edition"},"reviewerName":"spsanders","reviewText":"A compelling book about why we should not be afraid to ask for help from the strangers around us. Unexpected ideas can develop that enhance our talents.","summary":"Strangely Interesting","unixReviewTime":1397174400,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"11 1, 2013","reviewerID":"A3SK6VNBQDNBJE","asin":"1118461304","style":{"Format:":" Kindle Edition"},"reviewerName":"Leif C. Ulstrup","reviewText":"I have enjoyed Dr. Alan Gregerman's weekly blog ([...] and two previous books since taking an innovation class with Alan over a decade ago.  He opened my eyes to seeing the world in a fresh way and also taught me structured techniques that I can use to increase the creative problem solving skills of teams and individuals.\n\nAlan untangles the difference between invention and innovation and makes it much easier to see that 99%+ of innovation is adaption of proven inventions borrowed from other industries, disciplines, contexts, and cultures.\n\nHis previous book, Surrounded by Geniuses, is excellent.  It is a great mix of ideas and memorable examples of his insights in action.\n\nHis newest book, The Necessity of Strangers, builds on that previous body of knowledge and delves further into a critical dimension of his innovation research about the power of making connections outside of one's group to discover alternative approaches to addressing a challenge.  The book is full of excellent examples of individuals and organizations tackling challenges by seeking ideas and insights from \"strangers\".  Alan borrows heavily from personal experience which enriches the storytelling aspect that makes his writing so accessible.\n\nIf you have not seen Alan teaching his ideas or present to an audience, I would highly recommend it.  He has been a featured speaker at a solution architect leadership development program at our firm.  He recently presented the ideas from The Necessity of Strangers to a large audience of executives at our firm that left people talking, engaged, and energized.\n\nI highly recommend his books and Alan's live presentations.","summary":"Becoming more innovative by opening yourself to conversations with \"strangers\"","unixReviewTime":1383264000,"image":null}
{"overall":4,"vote":"2","verified":false,"reviewTime":"01 6, 2014","reviewerID":"A33HIV8RXRDM88","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Kanishk Rastogi","reviewText":"Seriously! We always get this career advice \"you gotta know the right people\", but no one else ever talked about the \"necessity of strangers\" in a successful professional life. Strangers are a necessity because of their differences and what they know that we don't know.\n\nThe author has described his work as Explore, Connect, Innovate, Grow...a simple 4 word approach each of which is self-explanatory in the context of professional growth. It is \"Innovate\" area where strangers can help you most by providing an objective opinion and being able to challenge you to think differently, and drive you out of your comfort zone.\n\nFurther, the author compares the small limits of exploring only within your network by comparing the magic number of \"150 active connections of an averagely connected person\" with the overall population of strangers i.e. 7 billion.\n\nAlmost all the chapters have some \"key points to remember\" which you may find redundant if you read management and leadership books, but overall the text does not get boring or mundane since there are small stories and anecdotes to draw comparisons and analogies.\n\nHowever, the key lesson learned is that interaction with strangers will always help you to fill the knowledge gap which you or your own existing network may not be able to fill. So, one need to keep expanding his network and seek their help to innovate and grow.","summary":"First 20 pages will convince you to read it full cover to cover","unixReviewTime":1388966400,"image":null}
{"overall":5,"vote":"3","verified":false,"reviewTime":"03 20, 2014","reviewerID":"A14DW5UMQ1M96O","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Mike Jannini","reviewText":"Alan Gregerman's consulting work and writings have helped me and many fellow executives keep our businesses competitive through enhancing our innovation capabilities.  In his most recent book, The Necessity of Strangers, Alan gives us additional pathways and processes to boost the quantity and quality of innovation in our organizations.  I used Alan's insights to enhance my efforts at Marriott International and the Cheesecake Factory Incorporated and will continue to refer to Alan's insights to assist me in my future professional endeavors.\nMike Jannini","summary":"The Power of Innovation","unixReviewTime":1395273600,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"02 27, 2014","reviewerID":"A2V7UVKOFG57IW","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"William Dahl","reviewText":"So refreshing to read something that provides unique insights into a subject area few authors have dared to explore. The authors young daughter piqued his interest in the subject and launched this noble literary endeavor. In an age that seems to be enamored in what we have in common - The Necessity of Strangers provides a landscape of confirmation about the value of the unfamiliar, difference, and things strange. A book that would be of interest to management consultants, marketing types and those involved in learning professions of all types. Like I said, I adored this work. I believe you will too.","summary":"Adored this book","unixReviewTime":1393459200,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"01 30, 2014","reviewerID":"A2BM5NTLX7CES1","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Taylor Ellwood","reviewText":"In this book, the author argues that strangers are an essential part of innovation and that to truly cultivate creativity and innovation we need to be open to new ideas, meeting strangers and learning from different cultures and disciplines outside of our own culture or discipline. The author illustrates this point through a variety of case studies in both business and everyday life to demonstrate how contact with strangers can be helpful for sparking innovation. While the case studies are interesting the author doesn't really explain how to implement these ideas. This is a good book to read to inspire you to be open to learning from other people, but while the author provides a couple of ideas on how to do that, for the most part what he discusses is shared as ideas as opposed to really examining how to implement these ideas meaningfully.  Still I recommend reading this book to challenge yourself to be more open to new ideas.","summary":"Why strangers make innovation occur","unixReviewTime":1391040000,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"01 18, 2014","reviewerID":"A1EQ5D5JRSW23K","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Erol Esen","reviewText":"What a great title this book has, The Necessity of Strangers! If you read Jared Diamonds book \"Guns, Germs, and Steel\", and then read this book, youll get a much better appreciation why this title matters in todays world. Its about exploring, connecting with new people and ideas, and to combine these ideas to create new, and to grow intellectually, spiritually, and wealth. The World as we know it didn't happen overnight.","summary":"we're all born a stranger, let's get to know one another","unixReviewTime":1390003200,"image":null}
{"overall":5,"vote":"2","verified":true,"reviewTime":"01 8, 2014","reviewerID":"A2I5QME4S7CLFI","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Laura F.","reviewText":"I usually find business books a re-hash of the same old advice, but \"The Necessity of Strangers\" certainly disproves that theory.\nAlan Gregerman offers a smart, common sense approach to thinking outside the box and being open to the possibilities all around us. If you want to challenge your thinking on innovation and collaboration, this is the book for you.","summary":"A New Twist on Out-of-the Box Thinking","unixReviewTime":1389139200,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"01 17, 2014","reviewerID":"A1R2JUOGIYH6HO","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Amazon Customer","reviewText":"The title of this book is what caught me and I was hooked from there. This is a great read full of studies and insight into how we work as individuals and as groups. I learned a lot and was impressed with how easy it was to wade into.","summary":"insightful read","unixReviewTime":1389916800,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"01 16, 2014","reviewerID":"A3JRW716H3AX14","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"Scott Lloyd","reviewText":"This is a well written book that reveals many counterintuitive ideas regarding how we think about those outside out tribe. This is an excellent book to shake up your thinking about social groups.","summary":"Easy to read, counterintuitive","unixReviewTime":1389830400,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"01 15, 2014","reviewerID":"A3KGLXW3EYDTUH","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"ck","reviewText":"Common sense and openmindedness are at the heart of Alan Gregerman's tome in praise of strangers. In clear and affable fashion, Gregerman guides his readers in an almost Socratic manner to embrace the insights and wisdom that are available to us once we look beyond the known.\n\nOddly -- or fortuitously -- enough, you and I are engaging in one of the practices he suggests in his book. One of the hallmarks of Amazon is its growing library of peer reviews and images. We don't know each other, and yet you paused in your consideration of this book to find out what earlier readers thought about it. And this is not a one-way street; there's every chance that you may use the \"comment\" function to add a question or other thought that would transform this from one person's observations and reflections into a conversation.\n\nMeantime, back to&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"\/The-Necessity-of-Strangers-The-Intriguing-Truth-About-Insight-Innovation-and-Success\/dp\/1118461304\/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">The Necessity of Strangers: The Intriguing Truth About Insight, Innovation, and Success<\/a>. Gregerman begins with context, reviewing reasons for the common mistrust of strangers before illustrating how small even the largest personal network is likely to be. The nod to Socratic method begins with him asking readers to think about effective ways of gathering information, improving product, and thoroughly understanding our underlying mindset -- why we think the way we do, and how we can stretch ourselves beyond the status quo.\n\nAfter exploring context, which he calls framework, Gregerman asks readers to consider how to translate interacting with strangers from abstract to concrete: using these new relationships to spur innovation, collaboration, leadership, and customers, both existing and new (yet more \"strangers\"). Before setting us loose on a newly inviting world, Gregerman provides a succinct toolkit of strategies and techniques that we can begin using in everyday situations, as well as ways to spur our thinking and reflection.\n\nHe makes many thought-provoking points, and I believe they are best read in sequence. In fact, if you have an e-reader, you may want to buy the digital version so that you can highlight and annotate particularly salient thoughts.\n\nHowever, it is worth touching on the four guiding principles that are at the heart of this book. \"Humility--the belief that we don't know everything and that we can always be better at the things that matter most. Curiosity--our innate gift for being open to new ideas, new people, and new possibilities. Respect--the belief that everyone matters and that we learn and grow by engaging other people on their own terms. Purpose--our reason for being that guides our efforts to learn and grow.\"\n\nAlthough most of  Gregerman's examples and prescriptions deal with the workplace, they are readily applicable to life beyond the office, and even to one's own reflective practice. Indeed, one of the overarching principles is to seek out differences -- different outlooks, different areas of expertise, and even different lands -- and almost immediately to build human bridges of commonality. Particularly dear to my heart is his repeated statement that travel enriches the traveler and brings the world closer. In that vein, if you'd like, please do feel free to treat this review as the start of a conversation.","summary":"Friends we have yet to meet","unixReviewTime":1389744000,"image":null}
{"overall":3,"vote":null,"verified":false,"reviewTime":"01 11, 2014","reviewerID":"A1B70ZEWQ6UH1A","asin":"1118461304","style":{"Format:":" Hardcover"},"reviewerName":"JustMe","reviewText":"The stated premise of the book, that strangers can improve your insight, innovation, and success, is true and is a relevant topic.  Gregerman presents a genial book that I wanted to like. OK, I did like it, but was still left disappointed because it didn't really deliver what it promised.  This isn't really a book about strangers, or being open to the influence of strangers, it's about openmindedness in general.  That's a fine topic too, but one that I have already read and thought extensively about.  That is why I was excited to find a book that would delve deep into one aspect of that -- openmindedness toward strangers.  Alas, this did not deliver.  IF you are looking for a fun and light, but still useful, book on openmindedness, in general, you should be very pleased.  This book offers a shallow look at many dimensions of openmindedness.\n\nEarly on, Gregerman writes, \"It may seem counterintuitive that strangers are to be embraced rather than ignored or avoided, but they are a necessity -- precisely because of their differences and what they know that we don't know; their objectivity and ability to be open and honest with us about the things that really matter; and their capacity to challenge us to think very differently about ourselves, the problems we face, and the nature of what is possible.  Finding and engaging the right strangers has the power to make all of us more complete, compelling, innovative, and successful.\"  This is exactly what I wanted, but Gregerman doesn't go into details on this.  He basically just tells us to talk with people.  Very general.  Indeed, the first chapter, Necessity, would have made a great article or Kindle Short, as that is where the heart of the idea is.  It's a great chapter in an otherwise average book.\n\nIn chapter 4, Innovation, Gregerman tells us to ask ourselves these 8 questions:  What's our best thinking to date?  What's the best thinking in our industry?  What's the best thinking in other industries?  What's the best thinking from popular culture?  What's the best thinking in other cultures?  What's the best insight from nature?  What's the best insight from science?  What are the best possibilities from science fiction?  OK, good questions, and Gregerman gives each a paragraph telling us why it is a good question, but does not give guidance on how to actually answer the questions.\n\nGregerman really stretches the definition of stranger.  At one point he uses fish as a \"stranger\" and discusses how the schooling behavior of fish led to innovations in accident avoiding cars.  Really, fish as strangers?  Isn't this really about openmindedness in general, and not openmindedness to strangers specifically?  Gregerman explicitly sidesteps the issue of strangers by stating that his approach is \"driven by the reality that in many ways almost all of us are strangers.\"  So, are we talking about openness to strangers, or about openness to people in general?  Why did the title of this book not refer to openmindedness rather than strangers?\n\nSome other books also offer insight into what strangers have to offer.  Check out Give And Take, by Adam Grant, which has more to offer than this book does, even though the premise is a bit different.  The Geography of Happiness may also be worth a look, though it is primarily about personal benefit, not business; but of course, these are entwined.  Another book, that Gregerman refers to is Carol Dweck's Mindset: The New Psychology of Success, which is specifically about openmindedness and closemindedness.\n\nGregerman seems like someone I would love to meet in person and talk with.  Really wish that he had examined the stated topic in more detail so that I could leave a more enthusiastic review.  Gergerman's last paragraph is a good summation of his book, so I present it here.  If this is what you actually want to read about, rather than an in-depth look at strangers, then you should enjoy this book:  \"Use these resources as a starting point for stretching your thinking or as a call to action to look in new places for ideas that could make a real difference to you and your organization.  Then commit to the regular habit of picking up a book or ebook, reading a magazine or blog, or watching a movie or TV show that takes you off of your well-beaten path -- not because everyone else around you is doing so, but because it might take you to a new and remarkable place where the possibility of a breakthrough awaits.\"","summary":"Fish are strangers?","unixReviewTime":1389398400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"05 23, 2014","reviewerID":"A1O1V5DBXB6DMP","asin":"1906487049","style":{"Format:":" Paperback"},"reviewerName":"mary","reviewText":"I'm an experienced knitter, who likes to make woman's clothing.\nKim's designs aero very feline, yet classic and well designed.\nThe book contains interesting summer designs, quite simple, but very wearable. I've bought it for a couple of cardigans that were showcased on Revelry.","summary":"Hard to find Kim's designs","unixReviewTime":1400803200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"06 2, 2013","reviewerID":"AT7W8XDH1EGGL","asin":"1906487049","style":{"Format:":" Paperback"},"reviewerName":"fibergirl","reviewText":"This book had some wonderful sweaters when I reviewed it so I was inspired to purchase it. When I received it, in addition to the beautiful sweaters, I enjoyed the many photos of the models having fun and being creative which added to the charm of this book. I have not started any sweaters but the instructions appear well written. Since I received it earlier than expected, I was able to share it at a gathering of other passionate knitters. They all loved the book as well. Happy Knitting!","summary":"Wonderful book","unixReviewTime":1370131200,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"07 17, 2012","reviewerID":"A2BE36GLSNCEOF","asin":"1906487049","style":{"Format:":" Paperback"},"reviewerName":"P.Poppy","reviewText":"Most excellent. Only down side to this book  are the pictures. Wish it had basic front\/side\/back views clearly identified. Instructions look easy to follow. Now I just need to decide on the yarns.","summary":"Breeze","unixReviewTime":1342483200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"08 20, 2015","reviewerID":"A3KBUSJHZO3P6A","asin":"6040985461","style":null,"reviewerName":"Vasile Nistor","reviewText":"looks like the original. Keep in mind this item comes from UK and takes about 3 weeks to get to US","summary":"looks like the original","unixReviewTime":1440028800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"03 13, 2009","reviewerID":"A24HQ894NFSTF5","asin":"7301113188","style":null,"reviewerName":"Maha","reviewText":"I like these containers so much i have ordered another set. The fact that they are flexible makes them really easy to use in the freezer, esp when you are in a hurry and want to get things out of the container quickly. I already own a lot of Tupperware products, and these i like the most. They are the most useful.","summary":"I Love the Freezer storage line..","unixReviewTime":1236902400,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"01 14, 2017","reviewerID":"A3B0UA9I9CEVBT","asin":"7861850250","style":null,"reviewerName":"Amazon Customer","reviewText":"Hard to open and close.","summary":"Three Stars","unixReviewTime":1484352000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 14, 2016","reviewerID":"AM7MY3DEWP7AW","asin":"8792559360","style":null,"reviewerName":"Michael Monhait","reviewText":"Best book ever written...","summary":"The Best","unixReviewTime":1481673600,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"05 19, 2016","reviewerID":"ALMBAY4H712C7","asin":"8792559360","style":null,"reviewerName":"Amazon Customer","reviewText":"I received this book for my  birthday, the pictures are beautiful, the \"behind the scenes\" knowledge is impeccable and it looks great displayed on our coffee table.","summary":"Finally a cigar book taking the craft of cigars seriously.","unixReviewTime":1463616000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"04 24, 2016","reviewerID":"A283UCG4U3AUOM","asin":"8792559360","style":null,"reviewerName":"Tony Mendoza","reviewText":"This is a great book. A fine combination of image and knowledge. I would recommend this book to anyone who loves cigar.","summary":"Great Images - Great Knowledge","unixReviewTime":1461456000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 30, 2016","reviewerID":"A3VD9JLBEITZFF","asin":"8792559360","style":null,"reviewerName":"W.","reviewText":"Definitely 5 stars.  I like everything about this book.  The size and weight of the book are perfect for what you'd want from a coffee table book on cigars.  Even the particular stock of the paper even gives it a rustic sophistication, again, matching what you'd expect from a cigar.  It is well written with plenty of substantive content on the production and appreciation of cigars (as opposed to blurb style content more fitting for an online lifestyle magazine.)  The photography is smartly done in its consistent style of large, numerous, richly detailed photos that, at the same time, are not over-stylized but still create a strong sense of immersion as you read through it.  The focus is primarily on the growth and assembly of cigars from their major production regions, and not so much on any particular brand or marketing of cigars, though it touches on everything to a degree.  I definitely recommend this.","summary":"I like everything about this book","unixReviewTime":1483056000,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"03 17, 2016","reviewerID":"A74TBP9UDF62J","asin":"8792559360","style":null,"reviewerName":"Amazon Customer","reviewText":"The complete cigar experience - You almost sense the smell of cigar leaves when reading the book. Bought mine as a present for my dad. He absolutely loves it!","summary":"Highly recommendable!","unixReviewTime":1458172800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 14, 2016","reviewerID":"A9EZ3SN4HHPTP","asin":"8792559360","style":null,"reviewerName":"Tom","reviewText":"great quality book. big, heavy duty paper, quality color printing.","summary":"Five Stars","unixReviewTime":1481673600,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"04 8, 2016","reviewerID":"A1A7HV01DD1YKW","asin":"8792559360","style":null,"reviewerName":"Happy customer","reviewText":"This is an extraordinary cigar book. The photographs are immensely beautiful and the authors have thoroughly investigated the theme. They communicate their knowledge about cigars in a beautiful and exciting way. If you have any interest in cigars - this book is a must have.","summary":"All you need to know about cigars!","unixReviewTime":1460073600,"image":["https:\/\/images-na.ssl-images-amazon.com\/images\/I\/71rZMhBBxwL._SY88.jpg","https:\/\/images-na.ssl-images-amazon.com\/images\/I\/71WoxOh6eML._SY88.jpg"]}
{"overall":2,"vote":null,"verified":true,"reviewTime":"10 16, 2016","reviewerID":"A3BWDM7YQ5ENXO","asin":"9792954481","style":null,"reviewerName":"Kittyrescuer","reviewText":"Did not completely descale my dishwasher","summary":"Two Stars","unixReviewTime":1476576000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"07 13, 2015","reviewerID":"A12UD9093P4A14","asin":"9792954481","style":null,"reviewerName":"Amazon Customer","reviewText":"great product for people like us with a hard water well","summary":"Five Stars","unixReviewTime":1436745600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"01 21, 2016","reviewerID":"A20JBUWRGLX9QK","asin":"B00002N5EL","style":null,"reviewerName":"Ron S.","reviewText":"Nice chrome, worked very well","summary":"Five Stars","unixReviewTime":1453334400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 20, 2014","reviewerID":"ATCY52ZP70FKP","asin":"B00002N7HY","style":null,"reviewerName":"Martinator","reviewText":"5-Stars all the way! Thanks!","summary":"Five Stars","unixReviewTime":1419033600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"05 30, 2016","reviewerID":"A2LNP1T89OK7ZS","asin":"B00002N7HY","style":null,"reviewerName":"Jim Ransom","reviewText":"Worked great","summary":"Five Stars","unixReviewTime":1464566400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"03 26, 2018","reviewerID":"A3TIWHNJXMSIU7","asin":"B00002N7HY","style":null,"reviewerName":"Torpex","reviewText":"Nice quality 220vac surface mount receptacle.","summary":"Five Stars","unixReviewTime":1522022400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"07 5, 2017","reviewerID":"A2UEH0U5CV3053","asin":"B00002N7HY","style":null,"reviewerName":"SJK","reviewText":"I used this 50-Amp Leviton 3-wire range receptacle to replace the damaged older Cooper brand 3-wire surface mount receptacle for our range. It worked perfectly and the holes in the back plate even lined up with the existing holes in the porcelain tile floor, which saved a lot of work for me by not having to drill new mounting holes.","summary":"Leviton 5050 50 Amp, 125\/250 Volt, NEMA 10-50R, 3-Wire, Surface Mount Receptacle","unixReviewTime":1499212800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"07 29, 2015","reviewerID":"AY41JC7MWFY1R","asin":"B00002N7HY","style":null,"reviewerName":"IBpackin247","reviewText":"product received as described","summary":"Five Stars","unixReviewTime":1438128000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"02 19, 2015","reviewerID":"A29FO9SI6VDCCK","asin":"B00002N7HY","style":null,"reviewerName":"Stuart","reviewText":"Always a great product","summary":"Five Stars","unixReviewTime":1424304000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"09 12, 2014","reviewerID":"A2V3DZW93FWH54","asin":"B00002N7HY","style":null,"reviewerName":"kngpn1","reviewText":"good","summary":"Five Stars","unixReviewTime":1410480000,"image":null}
{"overall":4,"vote":"2","verified":true,"reviewTime":"01 7, 2014","reviewerID":"AXE83MK90ZEVZ","asin":"B00002N7HY","style":null,"reviewerName":"Strom","reviewText":"It works, no fires, etc.  Why not 5 stars?  How can I really give a 50 amp Receptacle 5 stars?  What does a 5 star receptacle even look like?  If you find this has improved your life substantially then give it 5 stars.  For me I plugged in a charger.  I'm not proud.","summary":"expectations achieved.","unixReviewTime":1389052800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"02 26, 2016","reviewerID":"A5OV35IHA1I9D","asin":"B00002N7IL","style":{"Size:":" Pack of 1"},"reviewerName":"George","reviewText":"Meets expectations and easy installation.","summary":"Five Stars","unixReviewTime":1456444800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"03 26, 2018","reviewerID":"A3TIWHNJXMSIU7","asin":"B00002N7IL","style":{"Size:":" Pack of 1"},"reviewerName":"Torpex","reviewText":"this particular type is perfect and easily adapts to almost any box you mount. Item is high quality and does what its suppose to.","summary":"this particular type is perfect and easily adapts to almost any box you mount","unixReviewTime":1522022400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"05 4, 2016","reviewerID":"A1GJVKGHOJXBAM","asin":"B00002N7IL","style":{"Size:":" Pack of 1"},"reviewerName":"Bruce E Mikulcik","reviewText":"Part worked great...","summary":"Five Stars","unixReviewTime":1462320000,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"08 5, 2016","reviewerID":"A268RWSHYHDM27","asin":"B00002N7IL","style":{"Size:":" Pack of 1"},"reviewerName":"Taylor_85553","reviewText":"Solid. Mounts in a single or double box. I recommend double for the heavy wire.","summary":"I recommend double for the heavy wire","unixReviewTime":1470355200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"07 28, 2017","reviewerID":"A3LGE85KKHJWFK","asin":"B00002N7IL","style":{"Size:":" Pack of 1"},"reviewerName":"bert47","reviewText":"great buy.","summary":"Five Stars","unixReviewTime":1501200000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"07 31, 2017","reviewerID":"AJN26F4KMWD59","asin":"B00002N7IL","style":{"Size:":" Pack of 1"},"reviewerName":"Jerry Beckwith","reviewText":"Well made and works well","summary":"Five Stars","unixReviewTime":1501459200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"10 14, 2017","reviewerID":"A2J2T9LX2HC947","asin":"B00002N7IL","style":{"Size:":" Pack of 1"},"reviewerName":"John R. Smith","reviewText":"Yea baby","summary":"Five Stars","unixReviewTime":1507939200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"03 20, 2018","reviewerID":"AVP16JFIT6LPL","asin":"B00002N7IL","style":{"Size:":" Pack of 1"},"reviewerName":"RAFAEL FERNANDEZ","reviewText":"excellent","summary":"Five Stars","unixReviewTime":1521504000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"04 26, 2016","reviewerID":"A1C6CXABMGKW1V","asin":"B00002N7IL","style":{"Size:":" Pack of 1"},"reviewerName":"Gretta","reviewText":"Leviton has top notch products.","summary":"Thanks Leviton!","unixReviewTime":1461628800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"03 14, 2016","reviewerID":"A30U5519ZF4HV3","asin":"B00002N7IL","style":{"Size:":" Pack of 1"},"reviewerName":"George W.","reviewText":"Thank you","summary":"Five Stars","unixReviewTime":1457913600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"03 20, 2015","reviewerID":"A3SHVDMM83IHJ4","asin":"B00002N7IL","style":{"Size:":" Pack of 1"},"reviewerName":"steve crumpler","reviewText":"Just what I needed for my electric range. Matched pigtail cord and works great.","summary":"Matched pigtail cord and works great.","unixReviewTime":1426809600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"05 25, 2017","reviewerID":"A3M66IF7LFUS27","asin":"B00002N9OE","style":null,"reviewerName":"D. Fratini","reviewText":"These are so pretty. I put them on our new white kitchen cabinets. Everyone is so impressed with the designer look. Love them.","summary":"These are so pretty. I put them on our new white kitchen ...","unixReviewTime":1495670400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"06 27, 2016","reviewerID":"A13O7AXYRWR7SE","asin":"B00002NARC","style":{"Size:":" 1-Pack"},"reviewerName":"Kindle Customer","reviewText":"Nice plug","summary":"Nice plug","unixReviewTime":1466985600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"06 6, 2016","reviewerID":"ABEA3QXO2726L","asin":"B00002NARC","style":{"Size:":" 1-Pack"},"reviewerName":"AaronZ","reviewText":"Its a receptacle, what more can I say? It works as advertised","summary":"Five Stars","unixReviewTime":1465171200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"05 17, 2016","reviewerID":"AFGJZEC6S8UO7","asin":"B00002NARC","style":{"Size:":" 1-Pack"},"reviewerName":"Brooklynkid","reviewText":"Item as described, fast shipping...thanks","summary":"Five Stars","unixReviewTime":1463443200,"image":null}
{"overall":3,"vote":"3","verified":true,"reviewTime":"04 2, 2016","reviewerID":"A8LH8SK7KD381","asin":"B00002NARC","style":{"Size:":" 1-Pack"},"reviewerName":"Amazon Customer","reviewText":"I was disappointed that the device is not clearly marked as to which wire goes where. The webpage for the device says the terminals are marked green, silver and brass. The device I got had no colored terminals.","summary":"No colored terminals","unixReviewTime":1459555200,"image":["https:\/\/images-na.ssl-images-amazon.com\/images\/I\/31CdBfdTYvL._SY88.jpg"]}
{"overall":5,"vote":null,"verified":true,"reviewTime":"03 27, 2016","reviewerID":"A2EADB6Z2T3DFY","asin":"B00002NARC","style":{"Size:":" 1-Pack"},"reviewerName":"Lars","reviewText":"As advertised. Not much that can go wrong here.","summary":"Five Stars","unixReviewTime":1459036800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"04 20, 2013","reviewerID":"A2OXDRWBASV91Y","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"Harold E. Ewing","reviewText":"I like the fact that the wire ends have mounting tips assembled and that the cord has a strain relief clamp included.\nI'd recommend this to any diy person","summary":"complete package","unixReviewTime":1366416000,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"04 30, 2018","reviewerID":"ACAGDG7I3ZP7Q","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"MCF","reviewText":"The cable was much stiffer and tougher to arrange than anticipated related to other flat cables but it is considered good quality and good heavy duty overall.","summary":"... related to other flat cables but it is considered good quality and good heavy duty overall","unixReviewTime":1525046400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"11 9, 2013","reviewerID":"A1F8KMYRU1WEF2","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Darlene and David","reviewText":"Worked perfect and was cheaper than the same thing at Lowes. I put it on my oven and plugged it in. No complaints.","summary":"It's an over cord","unixReviewTime":1383955200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"04 23, 2018","reviewerID":"AMH5CUDJI208M","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"D K Garrison","reviewText":"Excellent. Worked perfectly on my new range.","summary":"Five Stars","unixReviewTime":1524441600,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"03 17, 2018","reviewerID":"A1ZYDXAFHF3IXW","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Amazon Customer","reviewText":"Good price","summary":"Good price","unixReviewTime":1521244800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"02 24, 2018","reviewerID":"A3G13F4UZ1P53N","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Jason","reviewText":"Was delivered faster than was told it would be. It is described as shown.","summary":"Five Stars","unixReviewTime":1519430400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 10, 2017","reviewerID":"A2BNNNIE7HZDZP","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Firestarter48","reviewText":"works great, thank you","summary":"Five Stars","unixReviewTime":1512864000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"10 19, 2017","reviewerID":"A2CQ8D7XKDWS2W","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"Tony Young","reviewText":"Very Nice Quality","summary":"Five Stars","unixReviewTime":1508371200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"05 5, 2017","reviewerID":"A33JUFX0TUF5XH","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Joseph C.","reviewText":"Worked and easy to install.","summary":"Five Stars","unixReviewTime":1493942400,"image":null}
{"overall":1,"vote":null,"verified":true,"reviewTime":"04 20, 2017","reviewerID":"A2R1B6W83BNWC9","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"MM","reviewText":"As was mentioned in other reviews, this cable is very inflexible. Although the individual wires are somewhat flexible, they are sheathed in a tough thermoplastic cover. I spent two hours cutting the cover back so I could install my RV connector. It reminded me of the Mutual of Omaha Wild Kingdom show where Marlin Perkins wrestled an anaconda. Not fun!!!!","summary":"EXTREMELY Hard To Work With!!!","unixReviewTime":1492646400,"image":null}
{"overall":5,"vote":"2","verified":true,"reviewTime":"03 16, 2013","reviewerID":"A2KG6AWJSWILPR","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"Christopher J Park","reviewText":"Needed another couple of feet with new dryer, perfect fit.  Gives you more options then the shorter cords normally sold.","summary":"Perfect Fit","unixReviewTime":1363392000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"04 12, 2018","reviewerID":"A2N78TLERYNKC8","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Rhize","reviewText":"Good product, flawlessly working with level 2 charger.","summary":"Five Stars","unixReviewTime":1523491200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 10, 2013","reviewerID":"A216Q289O6I5BD","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (New)"},"reviewerName":"GlacierBabe","reviewText":"Due to the nature of this item there is really not much to say except that it works and appears to be a high quality cord.  It meet the specifications for the range it supplies power to and met the approval of our electrician.  I would purchase another one if I had need of it.","summary":"Good quality cord","unixReviewTime":1386633600,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"03 6, 2018","reviewerID":"A1GFXHQET5572Q","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"CJMc1970","reviewText":"Needed this ti cut the plug off of to install plug end for welder. Worked well.","summary":"OK cable","unixReviewTime":1520294400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"07 21, 2014","reviewerID":"A3CJX4WBAVRK01","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"Debbie","reviewText":"easy to install.  just what I needed for my new stove.  fast delivery.","summary":"Five Stars","unixReviewTime":1405900800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"02 14, 2017","reviewerID":"A2CBE6VYOARZN4","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Gerry","reviewText":"Good quality at a reasonable price","summary":"Everything works","unixReviewTime":1487030400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"05 13, 2014","reviewerID":"A11QC8XY4UEWI7","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"Hawaii Shopper","reviewText":"Used for my Bosch EV car charger so it is not hard wired.  Allows the device to be unplugged and no crimping tools needed to terminate the main electrical wires feeding the device.","summary":"Great price and quality","unixReviewTime":1399939200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 21, 2016","reviewerID":"AVKOTZD5ZIOX5","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Dan W.","reviewText":"Planning on hooking this to my RV","summary":"50 amp cable","unixReviewTime":1482278400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"04 15, 2016","reviewerID":"A33DUVUIC7G553","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"Ryan","reviewText":"This product is a pretty simple one.  I do like prettymuch any product made by Southwire, they make good stuff. Coleman cable is now a subsidiary of Southwire.  If you go to your big box stores, most of the Romex you'll buy is made by Southwire, same with THHN \/ THWN you'd buy for conduit.\nI like to stick with brands I trust to make good products.\n\nI have no particular complaints about this, fits well in Leviton 14-50r as expected.  Well constructed and sturdy.  I like the 6-foot model so it's easier to install and pull out my range if needed.  Installation is simple with the prongs crimped on.","summary":"Good range cord, standard nema 14-50p fits with nema 14-50r","unixReviewTime":1460678400,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"12 27, 2015","reviewerID":"A2E8Q13IQL62XN","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"ken","reviewText":"WORKED GREAT","summary":"Four Stars","unixReviewTime":1451174400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"06 17, 2015","reviewerID":"A217M6GCFYSEVT","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"Randy D Etheridge","reviewText":"very good quality.  used as a feeder line to my 50amp fuze panel box in my enclosed trailer","summary":"very good quality. used as a feeder line to my ...","unixReviewTime":1434499200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"05 14, 2015","reviewerID":"A7S6BILPA0K7K","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"Bill S.","reviewText":"Excellent","summary":"Five Stars","unixReviewTime":1431561600,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"05 6, 2015","reviewerID":"A2Y7GJMFR0886X","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"JI","reviewText":"The cable works well and does what it should, so why only three stars? Maybe my expectations were unrealistic, but it was very difficult to maneuver the wire around, and difficult to get attach the ends in. They aren't the loops as pictured, rather squared prongs, which you can find pictures on other products. This made it more difficult in the application I had.","summary":"The cable works, but was hard to maneuver and wasn't exactly as picture","unixReviewTime":1430870400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"02 11, 2015","reviewerID":"AWHWKFAVSH827","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Chad T.","reviewText":"Most range cords are barely aduaqute for the amps they claim. This one is spot on and is great for anyone who likes to over do things like myself. The ones for sale at most home stores are for the \"typical\" install of 30-40 amps. This one is sized for a full 50 and it great because for my project I wanted to run a 50amp circuit to be used for other things like a welder. Although I am currently only using it to power a car charger that can at max pull 30amps. It's better to over size all the wiring which means less heat. Especially when you are charging a car for up to 10 hours.","summary":"Largest Gauge I Could Find","unixReviewTime":1423612800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"01 29, 2015","reviewerID":"A3UBM76TF3P37B","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Jordan Cooper","reviewText":"product worked well, delivered on time","summary":"Five Stars","unixReviewTime":1422489600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 17, 2014","reviewerID":"A22U6Z2M9TO90N","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"ChrisB.","reviewText":"Cheaper than locally, cant go wrong.","summary":"Five Stars","unixReviewTime":1418774400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"10 25, 2014","reviewerID":"AQ6PDHDC227KE","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Ralph Baker","reviewText":"Thank you done as promised","summary":"Five Stars","unixReviewTime":1414195200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"10 22, 2014","reviewerID":"A25RLL7WVGMH9B","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"Eaglesnest","reviewText":"Exactly what I needed and priced right!","summary":"Five Stars","unixReviewTime":1413936000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"09 27, 2014","reviewerID":"A9EJSFFDNX7ZT","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"CQB Techno","reviewText":"Very well made, Sturdy. It performs as advertised. Delivery was fast, packaging great.","summary":"Well made","unixReviewTime":1411776000,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"09 3, 2014","reviewerID":"A1GYDCCJW8CORK","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"Loretta H","reviewText":"did what it was intended for","summary":"Four Stars","unixReviewTime":1409702400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"01 13, 2015","reviewerID":"A2SNAR3RIPRR9B","asin":"B00004SQHD","style":{"Size:":" 6 ft","Style:":" (Old)"},"reviewerName":"Dave","reviewText":"Very good quality.  Just as advertised.","summary":"Great cable","unixReviewTime":1421107200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"07 26, 2014","reviewerID":"A3BJS0U3PZM3X1","asin":"B00004SQHD","style":{"Size:":" 4-Foot","Style:":" (Old)"},"reviewerName":"malaqua","reviewText":"I bought this cord as the power cord for the Connecticut Electric CESMPSC41GRHR power box reviewed elsewhere. It worked perfectly, using the proper cable gland nut to mount it into the power box. The 4 ft length of flexible cable and the installed 4 prong plug allowed me to conveniently plug the cord and CE power box into a 4-wire 50 amp rv pedestal and have 2 additional power circuits available for use on my RV. The cost of the cable was much less than fabricating the same size wire and building the cord from scratch.","summary":"Nice power cable","unixReviewTime":1406332800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"09 28, 2011","reviewerID":"A1XP22C1M2V9IL","asin":"B00004SQHH","style":{"Style:":" 5-Foot, 4-Wire"},"reviewerName":"Polcha","reviewText":"I bought this cable for our new dryer.  It was the perfect length and excellent quality.  Not too much to be said about this cable other than it is a great price.  I would not hesitate to buy this again.","summary":"Quality Cable","unixReviewTime":1317168000,"image":null}
{"overall":4,"vote":"2","verified":false,"reviewTime":"10 23, 2000","reviewerID":"A3MR51MDYU0KXJ","asin":"B00004X18E","style":null,"reviewerName":"BRADLEY KELLER","reviewText":"I use one of these for my tablesaw and it works great. the length is just right so your not stumbling on a bunch of extra cord you don't need. At 14 gauge you know this baby will not have a problem drawing the juice your tools demand. It's a nice well made cord just the right length with highly visable male and female ends.now get out there and plug something in.","summary":"GOOD QUALITY","unixReviewTime":972259200,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"12 4, 2014","reviewerID":"A1PR5ZLO040C6E","asin":"B00004YUMU","style":null,"reviewerName":"ggmommom","reviewText":"it is well built..does the job","summary":"Four Stars","unixReviewTime":1417651200,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"01 10, 2014","reviewerID":"AVVCS7Q0YOQFY","asin":"B00004YUMW","style":null,"reviewerName":"Zombienifty","reviewText":"The common wire screw was VERY hard to screw down , not sure if it really is tight on the wire.  Still, it's working.","summary":"Worked","unixReviewTime":1389312000,"image":null}
{"overall":4,"vote":"2","verified":true,"reviewTime":"01 12, 2012","reviewerID":"A313BC9WNQ0E5Y","asin":"B00004YWK2","style":null,"reviewerName":"Ishy","reviewText":"This was really easy to install and took me all of 10 or so minutes.  Most of that was spent wrestling with my drier hose.  Since the air is already being vented into the laundry room there's no issue.  When summer comes around I may have to take the product off.  The unit itself has gaps in the plastic.  I may have my husband seal it with some caulking or we may just remove it in the warmer weather.\n\nSince we live in such an arid climate this product is perfect!  It keeps the back of the house warm while the drier is going and adds much needed humidity to the air.  In climates that aren't a desert I'd be cautious, as it does put out a good amount of humidity.\nI don't feel as bad using the drier rather than my drying rack while using this product.","summary":"Works how it's supposed to in the winter.","unixReviewTime":1326326400,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"12 16, 2012","reviewerID":"A1HTPZLGXHYF6M","asin":"B00004YWK2","style":null,"reviewerName":"S. Dixon","reviewText":"Product does just what it says; lets you reclaim some of the heat from your drier.\nIt was easy to install, and the price is hard to beat.\nSeller packed it well and shipped it fast!","summary":"Easy to install works great!","unixReviewTime":1355616000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"11 24, 2012","reviewerID":"A2HRINI4ZC8SI1","asin":"B00004YWK2","style":null,"reviewerName":"Lyn","reviewText":"Installs in 15 minutes...not necessarily easy because of the ducting issues behind the dryer.  The dryer needs to be carefully  pulled out so as to not pull apart the ducting.  All in all a great idea, although somewhat of a kluge effect. It does work well, but be advised you need a fan in the utility room in order of move the air out of the confined space.  A larger room would not need this help.","summary":"Great tool to save on electricity.","unixReviewTime":1353715200,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"11 13, 2012","reviewerID":"A37T9ZLWVZBKUV","asin":"B00004YWK2","style":null,"reviewerName":"HotSpring","reviewText":"Works great. Remember to install the device in the right direction. The arrow on the unit will direct you. Also, might be better if you bought two 4 inch metal screw clamps from the hardware store rather than using the plastic ties they send with the unit. I went to Lowes and bought another section of exhaust tubing to make the device rise above the dryer and then anchored it to the wall. Also, I cut some material from an a\/c filter to the exact shape of the filter screen for better air filtration. This is a nice device and cheap as anything can be. Good luck.","summary":"Dryer Heat Exchanger","unixReviewTime":1352764800,"image":null}
{"overall":4,"vote":"4","verified":true,"reviewTime":"03 17, 2011","reviewerID":"A379FFPH5382H3","asin":"B00004YWK2","style":null,"reviewerName":"Bruce E. Watkins","reviewText":"This is basically a plastic box with a flap valve inside. Once I put a little super glue in the joints and pressed it together tightly, I liked its looks a little better. It has a rounded back, so it's not designed to mount on the wall: but I did anyway with a few drywall screws. The valve flap moves easily; also it has a mini-flap in the center of the vlave flap so that the dryer doesn't blow too hard into the house. The clamps that come with it aren't the best. I finally paid $2.50 each for hose clamps at the hardware store; these guys really hold tight !\n\nI used to hate the feeling of seeing all that steamy air streaming out of the house; it was like watching dollars blowing away ! This item seems like a good fix for that problem. Future electric bills will tell.","summary":"easy to install, keeps heat we paid inside the house !","unixReviewTime":1300320000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"10 31, 2012","reviewerID":"A2E4IH9IR09FP0","asin":"B00004YWK2","style":null,"reviewerName":"Just the Truth","reviewText":"In order to make sure no lint got into the house, we added an extra, home-made filter onto the exhaust filter.  Now we are thrilled with the results.  Lots of heat into the house, and no lint or excess moisture.  Everyone's house is different, so the moisture level may be a problem for some.  We took a hosiery knee-high stocking, and cut off most of the sock portion.  The elasticized portion (part that holds the knee-high near the knee) is the perfect size for fitting around the product's filter.  We sewed shut the other (cut-off) end.  Now we scrape lint out of the stocking and the product filter once every few days, and have no problems - only lots of \"free\" heat.","summary":"Works Well","unixReviewTime":1351641600,"image":null}
{"overall":1,"vote":null,"verified":false,"reviewTime":"03 18, 2011","reviewerID":"A3028R8VERNDHI","asin":"B00004YWK2","style":null,"reviewerName":"B. Cook","reviewText":"these are bad for your house.  they allow moisture in to your house which causes mold.  it you have build-up of moisture on the windows then you have a problem.  If you hook this to a gas drier then you also get carbon dioxide in your house.  if you really want moisture in your house then don't use the fan when you take a shower. you shouldn't need more humidty in the house if you cook, bath and breath.","summary":"poor Idea","unixReviewTime":1300406400,"image":null}
{"overall":2,"vote":"3","verified":true,"reviewTime":"09 5, 2012","reviewerID":"A6MDJBO9LWDGH","asin":"B00004YWK2","style":null,"reviewerName":"HiggetyPiggety","reviewText":"Poorly engineered and manufactured.\n\nMine arrived with broken tabs. Tiny, tiny tabs whose purpose may serve to aid manufacturing and assembly but are too weak to keep the clamshell-style halves together. These tabs are so dramatically under-engineered they either failed in shipping or didn't survive assembly at the factory. Good thing this product comes with tie wraps to attach the dryer hose... I'll need them to keep this product from \"unhinging\". The \"pressure relief\" feature is silly (a second flap in the middle of THE flap). This \"feature\" activates with the lightest puff of air completely compromising any seal (I'm being generous suggesting the parts of this product actually align properly) and makes the choice of directing the majority of air either indoors or out moot. Unless you disable this 2nd flap (i.e. duct tape) the air goes where it wants to.\n\nHere's my biggest problem - no pride in work. Not in design... Not in engineering... Not in manufacture. This product appears to have been compromised by committee and bean counters to maximize profit, not to deliver a quality product with value.","summary":"Disappointing","unixReviewTime":1346803200,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"04 26, 2012","reviewerID":"A17ODKZV8TK69X","asin":"B00004YWK2","style":null,"reviewerName":"Henry Bowman","reviewText":"This device is very easy to install, however, you're better off using a metal clamp than the included plastic ones.  As others have said, the included screen is terrible for filtering.  Use an old piece of nylon stocking instead.  Do not use it in a small, enclosed room as the increased moisture will coat everything in condensation.  Either wait 5-10 minutes for much of the moisture to exit the house, or open the door to your laundry room.","summary":"A handy way to save energy","unixReviewTime":1335398400,"image":null}
{"overall":4,"vote":"2","verified":true,"reviewTime":"04 16, 2011","reviewerID":"AKSHCRTIUM88N","asin":"B00004YWK2","style":null,"reviewerName":"Charles Taylor","reviewText":"Wife loves this product. In the northeast winters last a long time,this product puts both heat and water back into the house. Both items you want when the house is button up for the cold months. It arrived within a few days of ordering, would buy again. Deep six the plastic clamps,purchase 4in. metal at local hardware, and use nylon stocking instead of sreening.","summary":"wife loves it","unixReviewTime":1302912000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"05 27, 2011","reviewerID":"A2SZDB4QMI7MLV","asin":"B00004YWK2","style":null,"reviewerName":"KayJay","reviewText":"My husband installed this super quick and it does exactly what it says it will do.  We have oil heat which is so expensive that we don't want to waste any heat that we have going on in our house.  Our dryer vent runs down to the basement, so this is great for extra heat down there.  Of course it means I have to keep up with the laundry too...........lol.","summary":"Works Great and Easy to Install!","unixReviewTime":1306454400,"image":null}
{"overall":5,"vote":"4","verified":true,"reviewTime":"07 18, 2011","reviewerID":"A1Q6URSQQCPPC1","asin":"B00004YWK2","style":null,"reviewerName":"R. Hawkins","reviewText":"People are crying about quality - it's a dryer vent.  I've also seen (an removed) a lot cheaper ones, like the ones at the big box stores.\n\nIt's a little clumsy but works great - exactly as described.  Has a little flap in the main flap to blow off extra pressure (like if the screen builds up lint).  Seal up the edges with silicon or duct sealant if you don't like the very minor leaks.  Flap moves and locks well, and plastic housing is sufficiently thick.\n\nIf you're worried about the influence of outside air use an outside vent like the Lambro or Heartland.  You're dryer is going to leak air either way unless you use something that closes off the outside completely.  The only difference is you'll notice it at this junction before you notice it at the dryer but the same thing happens regardless.  It's not this devices fault.","summary":"exactly what I needed","unixReviewTime":1310947200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"09 14, 2011","reviewerID":"AUGA9EA77OMZ6","asin":"B00004YWK2","style":null,"reviewerName":"Freddie Manuel","reviewText":"This handy little gadget puts heat back into the house while filtering lint. For under ten bucks I think it's well worth it's price. Check it out!","summary":"Neat!","unixReviewTime":1315958400,"image":null}
{"overall":5,"vote":"2","verified":false,"reviewTime":"04 5, 2012","reviewerID":"A3LZ13IS49DF09","asin":"B00004YWK2","style":null,"reviewerName":"Hennes123","reviewText":"It worked great. Our dryer is in the center of the house so that helped. Mounting was OK. I opened it up and screwed it to the cabinet then closed it and add the tubes.","summary":"Worked great last winter","unixReviewTime":1333584000,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"10 7, 2011","reviewerID":"A1A60ALSV5DB5C","asin":"B00004YWK2","style":null,"reviewerName":"dust bunny","reviewText":"Great idea but there is no rubber seal so the valve can allow air to leak past the \"closed\" door in either position. I had a different valve that sealed much better. Overall still a good idea. I suggest covering the screen with something to stop air from leaking into the house when it is supposed to go outsied.","summary":"diverter valve","unixReviewTime":1317945600,"image":null}
{"overall":3,"vote":null,"verified":false,"reviewTime":"10 31, 2011","reviewerID":"A1216FXLLOHKCX","asin":"B00004YWK2","style":null,"reviewerName":"wells","reviewText":"It works, however it is cheaply made. It leaks a ton of air when the valve is suppose to vent the air outside (which you obviously don't want during the summer). Being the cool weather now though, that is ok. It works best to vent the first 15 min of air outside due to the high moisture and let the rest be directed back in the house.","summary":"OK, You get what you pay for.","unixReviewTime":1320019200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"03 17, 2012","reviewerID":"A2BWV92CFIMYJF","asin":"B00004YWK2","style":null,"reviewerName":"Dianne","reviewText":"The Heat Keeper with its handy damper makes it so easy to direct that warm, moist air from your Electric clothes dryer INTO your home when it's cold outside.  Also, it's so easy to flip the flap to send it outside in the summer.  Imagine how much of that expensive, moist air could be saved, recycled, and reused during cold winter months!  Why isn't the government on this?","summary":"Keep Your Heat -- OR Keep Cool.  Either way!","unixReviewTime":1331942400,"image":null}
{"overall":2,"vote":null,"verified":true,"reviewTime":"11 9, 2011","reviewerID":"A87BVZO1P3L1A","asin":"B00004YWK2","style":null,"reviewerName":"Zach Anspach","reviewText":"the 4inch by 8foot duct did not come with as stated in description. Would have bought elsewhere if I would have known this.","summary":"not as described","unixReviewTime":1320796800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"01 3, 2013","reviewerID":"ARUFF92T1NWUZ","asin":"B00004YWK2","style":null,"reviewerName":"Chris","reviewText":"If you want a cheap and easy way to heat a room and humidify it int he winter, this thing is great.  We have our dryer in teh kitchen and this thing its its super warm while the dryer is running.","summary":"Awesome","unixReviewTime":1357171200,"image":null}
{"overall":1,"vote":null,"verified":false,"reviewTime":"11 22, 2011","reviewerID":"A28NE4GRW9IRVT","asin":"B00004YWK2","style":null,"reviewerName":"Slurpie","reviewText":"Had one in my dryer system for about 10 years. Not very heat effective, and blows lint dust back into the laundry area. Not worth the trouble.","summary":"Heat Keeper - Not!","unixReviewTime":1321920000,"image":null}
{"overall":1,"vote":"2","verified":true,"reviewTime":"12 20, 2011","reviewerID":"A1VEX8UG96ZW8","asin":"B00004YWK2","style":null,"reviewerName":"ShopperCleveland","reviewText":"Despite the non glowing reviews I read, I bought 2 of these anyway.  Shoddy construction for sure!  Several of the reviews mentioned that the screen does not contain the lint so after busting out the scissors and a pair of tights I realized that they were all I needed.  I attached the cut off tight to the end of my vent with a rubber band and promptly packed up the UN-needed heat keeper.  When June hits, I will reattach the vent to the outside wall.","summary":"Do NOT waste your money!!","unixReviewTime":1324339200,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"12 21, 2011","reviewerID":"A2ZZ1CXXXEWIM2","asin":"B00004YWK2","style":null,"reviewerName":"Jericho","reviewText":"I will start by saying I live in Arizona.  Even then, it gets pretty cold in the winter.  Our winters also tend to be fairly dry, ESPECIALLY when using artificial heat in the house.  This vent does two things.  First, it adds heat to the house.  Second, it adds much needed moisture to the air.  When doing several loads of laundry the warmth and moisture is noticeable and much appreciated.  My only complaint is the actual construction of the unit leaves something to be desired.  The plastic has gaps and the air deflector does not fit as tight as I would like.  I do appreciate being able to capture the warm, moist air that might otherwise be lost outside in the winter.  Overall a good (but not great) product.  Would I buy it again?  If I couldn't find something built better, yes.","summary":"Energy saver- Could be constructed better","unixReviewTime":1324425600,"image":null}
{"overall":2,"vote":null,"verified":false,"reviewTime":"06 27, 2011","reviewerID":"A5WLZSUCRYWM4","asin":"B00004YWK2","style":null,"reviewerName":"Chris Taglia","reviewText":"I purchased this at Menards and promptly returned.\nBasically, it is very cheap. The two pieces that make up the housing don't form a hermetic seal (not that you can't just use some foil tape or duct seal). I installed this rather quickly and sealed things up well.\n\nOn my test run, I noticed that warm, moist air was blowing right through the vent. Granted, much of the air was deflected outside, so it is better than just dumping all the air into your house.\n\nAlso, I felt that the lint screen was inadequate. The mesh isn't fine enough to catch the small pieces of lint that make it into the vent. The screen really might as well not even be there.\n\nSo, I'm back to doing what I did before: remove the duct from the outside vent, point it inward during the winter, and plug up the exterior vent with some insulation.","summary":"Cheaply made and the valve leaks moist air when it is set to vent outside","unixReviewTime":1309132800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"01 22, 2013","reviewerID":"A17Y465UXZOJE3","asin":"B00004YWK2","style":null,"reviewerName":"Stickman","reviewText":"Yes, I'd rather have an item that was better made with higher quality parts and materials. However, for less than $10, this device does the job. It was easy to install and my only suggestion is that on the output, where the screen pushes on, I wish that was longer so I could attach a hose to go a better filter\/screen. The one that comes with it works, but it's a pain to have to clean everytime.\n\nAll in all a very good device that will certainly save us money.","summary":"Does what it's supposed to do for a very cheap price.","unixReviewTime":1358812800,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"04 10, 2013","reviewerID":"A16RQOWNVD8JI7","asin":"B00004YWK2","style":null,"reviewerName":"P. Snyder","reviewText":"This product works good, but is kinda difficult to mount on a non-flexible duct.\nI used duct tape to mount it to my solid ducting and it works fine.","summary":"Works good.","unixReviewTime":1365552000,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"02 13, 2013","reviewerID":"A2098GTTMARU5G","asin":"B00004YWK2","style":null,"reviewerName":"Take Time to Heal","reviewText":"this is exactly what is pictured, and easy to work with. though i did buy metal clamps, since im not fond of the plastic ones","summary":"works fine","unixReviewTime":1360713600,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"12 15, 2013","reviewerID":"A2X66A9HPMDH8T","asin":"B00004YWK2","style":null,"reviewerName":"CS","reviewText":"What makes this on the best is a little 2 part door inside.  You can set the doors to closed and all the air goes outside in the summer.  In the winter you can turn the door 90 degrees so the warm air stays in the house.  The second little door is in the center of the bigger door.  If the screen gets clogged the air sill open the small door and allow the vent to go outside.","summary":"Tried others, buy this one","unixReviewTime":1387065600,"image":null}
{"overall":1,"vote":null,"verified":true,"reviewTime":"12 14, 2013","reviewerID":"A24D6WOEP7PP3W","asin":"B00004YWK2","style":null,"reviewerName":"Tom","reviewText":"Does not seal well for summer or winter setting. Of particular concern would be the summer setting where you want the hot moist air to go outside your house. This unit will NOT seal well and you will have to cover it will plastic during the summer....so might as well just change from summer to winter mode \"manually\".","summary":"Don't buy it","unixReviewTime":1386979200,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"12 8, 2013","reviewerID":"AVV6SULI41K6P","asin":"B00004YWK2","style":null,"reviewerName":"Ken Esq","reviewText":"This seems to work pretty well. Took me about 15 minutes to install (and that included finding my step-ladder). The switch is a bit flimsy, but it's not horrid. It's not going to heat your whole house, or even your basement, but every little bit helps and it's better than pumping the hot air into the backyard.\n\nNote, that there is a gravity flap on plastic flap which I assume is there in case you let the lint filter get clogged up. However, it doesn't take much pressure for that flap to be pushed up which means that about 25% of the heated air is going to escape outside no matter what position the switch is in. I would not suggest taping that flap down though...just don't be shocked on a cold morning if you see a little heated air coming from your outside dryer vent.","summary":"Works well, Easy Install","unixReviewTime":1386460800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"11 13, 2013","reviewerID":"A2633VANDHCM7","asin":"B00004YWK2","style":null,"reviewerName":"paulette michel","reviewText":"It keeps the basement warm and is extremely easy to install and most important , the filter is so easy to clean","summary":"The dryer accessory you need","unixReviewTime":1384300800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"11 10, 2013","reviewerID":"A36QEY3SFO3KRP","asin":"B00004YWK2","style":null,"reviewerName":"Rhonda G","reviewText":"THIS IS MADE MORE FOR A BASEMENT BUT IS A VERY GOOD PRODUCT I WOULD RECOMMEND THIS TO ANYONE LOOKING FOR SOMETHING SIMPLE AS WELL AS HELPING TO HEAT THE BASEMENT OR WHEREVER U KEEP YOUR WASHER AND DRYER","summary":"HEAT","unixReviewTime":1384041600,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"10 30, 2013","reviewerID":"A3M2S6EMYVP10S","asin":"B00004YWK2","style":null,"reviewerName":"smbkrn","reviewText":"For a number of years, I've had the 'Square Box' dryer vent diverter (also sold by Amazon, Ace Harware and Home Depot). The square type often fell apart when the lint screen was removed for cleaning. The diverter flap hasn't worked for some time.\n\nYes, the Dunda Jafine model is a definite improvement, although the construction remains too fragile IMO. I would gladly pay a small premium for a more solid unit.\n\nAlso, while the lint screen is very easy to remove, it also very course and will likely dump a fair amount dust back into your basement or utility room -- I plan to experiment with placing a nylon stocking over the screen.\n\nI also used metal clamps rather than the nylon tie wraps provided. I managed to fastened the diverter to the basement wall with a set of 3M Velcro-like fastening strips. The fastener adhesive would not stick to the concrete wall so I used Gorilla glue for the one strip.\n\nTreat this unit gently when flipping the flap back an forth. Make sure that no lint is blocking the movement (I think that's what did in my old diverter). It's a always good idea to clean it with each load of clothes just as you would the dryer lint screen.\nWill provide an update in a few months if anything changes.\n\nUPDATE 18 MONTHS LATER -- I had to replace the unit as the small trap door on the flap had become detached and lost. This meant that some warm air would come back into the basement in the 'Summer' setting. This validates my original review: a well designed product but please couldn't it be beefed up to be more durable?","summary":"Design Superior to 'Square Box' Diverter. But Treat It Gently.","unixReviewTime":1383091200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"10 22, 2013","reviewerID":"A2VGD9B817PXFN","asin":"B00004YWK2","style":null,"reviewerName":"Crown King Robb","reviewText":"I actually routed this output into our crawl space area rather than into the house living space.  Its a simple unit and Im glad I put it in.","summary":"great way to recycle heat and moisture","unixReviewTime":1382400000,"image":null}
{"overall":4,"vote":"2","verified":true,"reviewTime":"10 11, 2013","reviewerID":"A1Y9K3QLN51BXF","asin":"B00004YWK2","style":null,"reviewerName":"MattD","reviewText":"Got it today, installed it and tossed a load of wet clothes in the dryer and turned it on with the damper set to blow into the house....Wow!  I never realized how much heat was being wasted just blowing through a hole in the wall!  If you have never seen one of these working it is just like a heating vent from a forced air furnace!  The actual construction of the whole thing is pretty cheap and a couple of ears molded onto it would have been nice for screwing it in place on the wall.  I drilled a hole inside at the back of it and secured it in place with a couple screws. It seems sturdy enough I guess, time will tell. ;-)","summary":"I've been missing out on this....","unixReviewTime":1381449600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"09 11, 2013","reviewerID":"A27XC2HGQOX0BZ","asin":"B00004YWK2","style":null,"reviewerName":"NMDodger","reviewText":"We had one before and couldn't find a replacement for it.  We like the heat blowing into the house in the winter.","summary":"Had one before","unixReviewTime":1378857600,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"08 14, 2013","reviewerID":"A3S3UA3D7TXBS6","asin":"B00004YWK2","style":null,"reviewerName":"Bill Matthews","reviewText":"It is made of plastic. It is not the best vent i have owned, but it does a pretty good job of redirecting the drier air between the outside (for the summer months) and the inside laundry room (for the winter months)","summary":"Heat redirector vent","unixReviewTime":1376438400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"08 2, 2013","reviewerID":"A2M0FK9WA59WWT","asin":"B00004YWK2","style":null,"reviewerName":"Frybry","reviewText":"This product helps put moisture back in the air in your house during the winter and helps heat it also.","summary":"Great for dry indoor air in winter","unixReviewTime":1375401600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"06 28, 2013","reviewerID":"A8A3N3S5HPPEH","asin":"B00004YWK2","style":null,"reviewerName":"Lori Ann Hicks","reviewText":"This adds moisture to the air in the winter and then switch to outside for summer.  Save that energy!  Good job.","summary":"does what it should do","unixReviewTime":1372377600,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"06 17, 2013","reviewerID":"A38MGPTXM9ZJVI","asin":"B00004YWK2","style":null,"reviewerName":"Jeff Layman","reviewText":"This product does what it says, conserving heat and humidity inside the house during the winter and exhausting the same during the summer.  It was easy to install with the included clamps, and after two years of use I haven't had issues with lint dust.\n\nI noticed that although the \"summer\" setting seems to be tight, a significant amount of the air escapes past the valve on the \"winter\" setting.  I would guess that about a fourth of the air escapes to the exterior in winter.  This means that I don't see 25% of the savings I had hoped for.  To look on the bright side, I am still saving 75% of the warm, humid air, so I would buy this product again.  However, I would prefer a product of better quality, even if it cost more.","summary":"Good, but leaks a bit","unixReviewTime":1371427200,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"05 26, 2013","reviewerID":"AE2URYCBT0SX9","asin":"B00004YWK2","style":null,"reviewerName":"ZED","reviewText":"I had one of these, similar, but not the same for many years. It finally died, with the handle snapping off, and one of the plastic clamps biting the dust with it. The handle allows you to choose IN or OUT for the dryer air.\nI put an old stocking over the front. I don't trust the rather wide grating filter to grab fine dust. The screws on the metal clamps which I bought with this had to be tightened almost to the end. Seems like this unit is a bit narrower than my old one, but it fits.\nBTW, these are great gizmos to add a bit of humidity to a heated basement which can get dry in the winter. When I'm using the dryer with the air directed IN, I can turn off one of the humidifiers.","summary":"A replacement for one which broke","unixReviewTime":1369526400,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"05 21, 2013","reviewerID":"A17IU11U0ZX1KA","asin":"B00004YWK2","style":null,"reviewerName":"Isuzan","reviewText":"I installed this baby recently (I've owned it for awhile; just sat here in the box).  I found that, as many reviewers have said, that the side entry points for the 4\" dryer venting tubes are not a tight fit at all.  I tried to use the zip ties they provided (Uhh....guys, these are NOT clamps!) but they don't even go the entire distance around the 4\" tube!  So, since I had the product basically jammed between the venting coming out of the dryer and the venting to the outside of the house, I just duct taped around the edges.  No zip ties required.\n\nOne thing I found out after the fact:  The little flapper in my unit was not attached.  Yup, didn't figure this out until I had the thing \"installed\".  So, I had to take it apart, reach in and snap it in place.  I did what someone else recommended - put a used dryer sheet behind the removable lint filter. I only had the thing on \"open\" a day or two then it got super hot here in the mid-west, so it's all venting outside now.\n\nI look forward to a lint-free way to enjoy the heat I'm creating in the winter from my dryer.  I will update if things change; but you get what you pay for here.","summary":"Not easy to install with zip ties...used duct tape!","unixReviewTime":1369094400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"02 9, 2011","reviewerID":"A2GJ29QY49N3DB","asin":"B00004YWK2","style":null,"reviewerName":"P. Ziobrzynski","reviewText":"It installed very quickly. I cut a section of existing vent and placed slid the vent valve in. It has a simple flap that directs the air outside or through the circular opening to the inside. Now I can turn on the dryer and heat the garage very quickly.\nGood product.","summary":"Great way to heat your garage.","unixReviewTime":1297209600,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"05 9, 2013","reviewerID":"A1VD0IGPNKP6X5","asin":"B00004YWK2","style":null,"reviewerName":"T. Cannon","reviewText":"I had another brand that I used for 10 years but screen finally broke. What I like about this one is that the screen comes off more easily than my old one (that is sold by a national hardware chain). What I don't like about this one (that I liked about my old one) is the quality. There are gaps in the seams so not all of the dryer exhaust is directed by the Heat Keeper, some leaks out the seams and some leaks to outside. Another criticism that I have is that the screen is not very fine and for some reason is harder to clean than other dryer filters.\n\nNeither this device nor my old one does a great job of containing dust and lint. While a lint catching bag might be able to be tied over the exhaust on this one, I haven't tried that. I'd really like to see a device like this that, when used to keep heat in the house, would filter the dryer exhaust through water. There must be a cleaner solution to keeping the heat in the house.","summary":"It does the job","unixReviewTime":1368057600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"04 24, 2013","reviewerID":"A2282V7ICQ8NPB","asin":"B00004YWK2","style":null,"reviewerName":"Doc","reviewText":"Product shipped fast and I was surprised by quality better than I thought especially going by price also very easy to install and works as advertised easy switch run dryer heat in when cold flip of a switch out when hot love product","summary":"great heat keeper","unixReviewTime":1366761600,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"04 5, 2013","reviewerID":"A1AMCUUMMJ76SJ","asin":"B00004YWK2","style":null,"reviewerName":"PRFREY","reviewText":"I installed this in about 10 minutes using metal clamps instead of the chintzy zip ties it came with.  I followed the advise of other reviews and put a nylon stocking over the vent for extra lint catching.  It works good and I think is worth the price paid.","summary":"Pretty Good Product","unixReviewTime":1365120000,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"04 3, 2013","reviewerID":"A3ANJAL6WAGISZ","asin":"B00004YWK2","style":null,"reviewerName":"Patrick James","reviewText":"It a simple piece of plastic, but it works. Make sure you clean it after every 2 dryer loads or the screen blows off form the pressure.","summary":"It works.!!","unixReviewTime":1364947200,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"03 28, 2013","reviewerID":"A31I9GY8AQK988","asin":"B00004YWK2","style":null,"reviewerName":"W. B. 3","reviewText":"Ok, it works fine, the removable filter is ok, but you have to run dryer hose above your dryer, and a second hose back down and out the exit.  Note that there are no holes in it to mount it, and we had to drill several and get it mounted to drywall.  It isn't that great to look at if you have a nice laundry room versus a basement hidden one.  However, it's good at efficiency, as that heat would be wasted otherwise.  Also, the screen does a great job of keeping lint out of your living area.","summary":"Works, but awkwardly","unixReviewTime":1364428800,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"03 20, 2013","reviewerID":"AMTP99FS7VJ6K","asin":"B00004YWK2","style":null,"reviewerName":"Scott","reviewText":"This is a handy thing to have in a cool dry basement. The construction is descent. It could stand to be a little tighter fit. . The plastic seems are a little off. But considering its half the price as Walmart or Lowes I won't complain.","summary":"Works","unixReviewTime":1363737600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"03 13, 2013","reviewerID":"A2M7PPYXV7AKD","asin":"B00004YWK2","style":null,"reviewerName":"B.","reviewText":"I needed to replace an similar type unit.  It is square and has a square closure flap but I don't recall the name.  This unit is much better in design and more thoroughly thought out as to design and use.  The flap in this unit can be locked in place with the control\/set lever shown in photo.  So you can lock it open or closed, a problem with the other unit was the flap would fall between dryer loads and would have to be reset.  Plus this unit came with two nylon closures for the flex lines.\n\nI HIGHLY RECOMMEND IT.","summary":"Well designed, much better than square one it replaces.","unixReviewTime":1363132800,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"03 10, 2013","reviewerID":"A214QSKWY16VFK","asin":"B00004YWK2","style":null,"reviewerName":"B","reviewText":"for the kitties living in there, but makes the garage floor wet in the area.  Perhaps condensation from the drastic change in temperature.","summary":"its heating my garage somewhat","unixReviewTime":1362873600,"image":null}
{"overall":2,"vote":null,"verified":false,"reviewTime":"02 21, 2013","reviewerID":"A2JU5ZC2L8F9E5","asin":"B00004YWK2","style":null,"reviewerName":"Vwiz","reviewText":"I bought this unit to insert into the dryer's exhaust tubing in order to switch between the much better Indoor Lint Trap Filter I was also ordering, and the outside exhaust port (without using its included screen). The reviews on the Dundas unit were not good enough for me to use it exclusively as a filter trap, but as a diverter, yes. Great idea: exhaust heated air through a better lint filter into the basement during winter, exhaust heated air outdoors during summer by simply turning the lever. Great idea defeated: the manufacturer \"improved\" the unit by making a large hole in the diverter flap to prevent \"blow back\", thus defeating my purpose. To fix this problem, I cut out a round disc from a plastic lid and glued it onto the flap.\nA trip to my local hardware store for more ducting revealed that they had a better made unit (sans flap hole) with a lower price (and no shipping). The unit now serves my intended purpose, albeit at greater expense and more work.","summary":"Works better as a diverter, after modification.","unixReviewTime":1361404800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"02 11, 2013","reviewerID":"A1W8N0TRRCMPJB","asin":"B00004YWK2","style":null,"reviewerName":"Robert O. Oberkrom","reviewText":"this is a great item to help with the moisturizing in the winter time and the added heat in the basement makes doing laundry in the winter that much easier.","summary":"Dryer vent","unixReviewTime":1360540800,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"01 31, 2011","reviewerID":"A1MOT6Z28G91LB","asin":"B00004YWK2","style":null,"reviewerName":"efficiency","reviewText":"I find that the Dundas heat diverter works as designed. Yes, it is lightweight and can come apart but with a little tweaking it is well worth the cheap cost. Installation? I just screwed it to the wall.\n\nThe biggest complaint that people have is about the screen allowing lint to go through.  SOLUTION Pull off the screen cap, place a used dryer sheet over the opening, put the cap back on.  Now you've got a second, finer screen which, after two uses (dryer sheet length is twice the diameter) you dispose of it.\n\nMoisture accumulation in the laundry room is no problem in that it is a well heated and ventilated area. The moist hot air has plenty of opportunity to disperse and contribute to our comfort. With my gas heat going we have plenty of good use for the moisture.  Win Win. When summer comes I will probably bypass the whole thing connecting the flex tubes to each other making sure all heat goes outside. Yes, it has a flap but it's only about 95% coverage.\n\nI would use metal screw hose clamps on the tubing for maximum fit. That also helps pull the plastic housing together.","summary":"Dundas heat diverter WORKS beautifully","unixReviewTime":1296432000,"image":null}
{"overall":3,"vote":"44","verified":true,"reviewTime":"11 29, 2008","reviewerID":"A30860LMO2PYWZ","asin":"B00004YWK2","style":null,"reviewerName":"AB from Los Alamos","reviewText":"The device does what it says, it keeps the warm moist air in the house when wanted.  The only problem is that lint filter is not that fine.  We took off the supplied lint filter and attached a cut off leg from a pair of pantyhose to the vent with a rubber band.  This works much better than the supplied lint trap as the pantyhose have a finer mesh and do not have to be cleaned as often.","summary":"Lint Screen could be a little better","unixReviewTime":1227916800,"image":null}
{"overall":1,"vote":"4","verified":true,"reviewTime":"01 28, 2011","reviewerID":"A2UJXSZGJNSS2Y","asin":"B00004YWK2","style":null,"reviewerName":"R. Schubert","reviewText":"First let me start by saying, \"this product is extremely poorly made.\"  Secondly, it was advertised as coming with: \"Includes a 4-Inch by 8-Foot ProFlex UL 2158A dryer transition duct,\" which wasn't anywhere to be found.  This is made of very thin plastic and the parts do not fit together well so there are open seams which allow air (and lint) to escape into your room.  The damper is also poorly made and allows air to escape the unit into the \"closed\" duct so it isn't very effective.  Another negative aspect of this device is that there are no mounting brackets or fixtures for keeping this on or against your wall.  So please consider it's going to cost you more for mounting brackets, additional duct work, better clamps (comes with zip ties) and that this product doesn't work effectively.  I guess you've figured...I'm sending this back for a refund.","summary":"Not As Advertised","unixReviewTime":1296172800,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"11 14, 2017","reviewerID":"A398K8IUQ847ZU","asin":"B00004YWK2","style":null,"reviewerName":"Donald Smithyman","reviewText":"I wanted to divert the dryer heat into my shop which backs onto the house, hence the two round homes allowed for that ducting... it does the job fine but be advised it is a light weight product.","summary":"it does the job fine but be advised it is a light weight product","unixReviewTime":1510617600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"11 29, 2017","reviewerID":"A3HCE9WN58GVA6","asin":"B00004YWK2","style":null,"reviewerName":"Aaron","reviewText":"I use it with fabric softener and my basement smells awesome and it adds a nice amount of warmth and humidity in the colder months.","summary":"Stop wasting heat in the winter.","unixReviewTime":1511913600,"image":null}
{"overall":1,"vote":null,"verified":false,"reviewTime":"12 2, 2017","reviewerID":"A1YJKI6PHXPAJ7","asin":"B00004YWK2","style":null,"reviewerName":"No Name","reviewText":"This product will encourage mold in your house!","summary":"MOLD","unixReviewTime":1512172800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 14, 2017","reviewerID":"A2GFAE3Y6UIT1A","asin":"B00004YWK2","style":null,"reviewerName":"Jon Ellis","reviewText":"Part was as expected and easy to install and works great.","summary":"Five Stars","unixReviewTime":1513209600,"image":null}
{"overall":2,"vote":null,"verified":true,"reviewTime":"12 15, 2017","reviewerID":"A39KY97QD3FMA3","asin":"B00004YWK2","style":null,"reviewerName":"RLP65202","reviewText":"You can't just flip the lever in the winter and switch it back in the summer.  It seals so poorly that it will let in more cold in than you can recapture with the device.  I will go back to removing the hose in the winter and stuffing the remaining hole in the wall with insulation.","summary":"Lets all the cold in.","unixReviewTime":1513296000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"01 21, 2018","reviewerID":"A2F2MP4CZX5Q2C","asin":"B00004YWK2","style":null,"reviewerName":"Ben Sanders","reviewText":"For around $10 surprised how well it actually works.\nHelps with adding humidity, and does a good job of trapping lint.\n\nDrilled two wholes in the back seam to wall mount it.","summary":"surprised how well it actually works","unixReviewTime":1516492800,"image":["https:\/\/images-na.ssl-images-amazon.com\/images\/I\/81nkt+y24HL._SY88.jpg"]}
{"overall":2,"vote":null,"verified":true,"reviewTime":"01 26, 2018","reviewerID":"A3GFI4NCJHQG60","asin":"B00004YWK2","style":null,"reviewerName":"Ray","reviewText":"Junk. poorly made and constructed.","summary":"Not for me","unixReviewTime":1516924800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"01 29, 2018","reviewerID":"A1UUX6CM15ASGB","asin":"B00004YWK2","style":null,"reviewerName":"Dave","reviewText":"Exactly as expected and. works perfectly.\nUsing these to better circulate fresh air in the garage, and also as an exhaust for a portable AC unit.\n\n There are a few variations to these types of products:::\n\nSome friendly advice - Read and understand what these can be used for, and what not to use them for. Also there are models with different types of divertors.","summary":"Using these to better circulate fresh air in the garage","unixReviewTime":1517184000,"image":null}
{"overall":1,"vote":null,"verified":true,"reviewTime":"02 3, 2018","reviewerID":"ADZ3I83346AQZ","asin":"B00004YWK2","style":null,"reviewerName":"john f dwyer","reviewText":"The straps are too short,now i have to drive 16 miles to the nearest hardware store to get some longer clamps ,defeats the purpose of using amazon","summary":"Straps too short if i had known I wouldn't of wasted my money and just bought one at the store and made sure the tie straps were","unixReviewTime":1517616000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"07 19, 2016","reviewerID":"A1ISAGPQ7AIBY1","asin":"B00004YWK2","style":null,"reviewerName":"JAN CHIN","reviewText":"WORKS","summary":"WORKS","unixReviewTime":1468886400,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"12 12, 2016","reviewerID":"A3MJ4NJE1XSZUQ","asin":"B00004YWK2","style":null,"reviewerName":"Mark F.","reviewText":"ITS WHAT I WANTED BUT NOT INSTALLED YET","summary":"Three Stars","unixReviewTime":1481500800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"10 19, 2017","reviewerID":"AQ7W4UBKIHTKG","asin":"B00004YWK2","style":null,"reviewerName":"Bob","reviewText":"The purchase was awesome , had it for 2 years now , going on the 3rd winter . Now understand my laundry room is in  an area that gets cold , i have an Electric baseboard heater in there , plus this unit that allows the heat to stay in while drying","summary":"The purchase was awesome, had it for 2 years now","unixReviewTime":1508371200,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"12 20, 2016","reviewerID":"A2CKQ1NIJ2PGRX","asin":"B00004YWK2","style":null,"reviewerName":"Special","reviewText":"Re routs the heat from the dryer to the house, I can turn off the humidifier on the furnace","summary":"Good product, easy install","unixReviewTime":1482192000,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"12 29, 2016","reviewerID":"A3INCBCPJNK1PW","asin":"B00004YWK2","style":null,"reviewerName":"Amazon Customer","reviewText":"Let's a lot of moisture in the air for us.","summary":"Three Stars","unixReviewTime":1482969600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"01 11, 2017","reviewerID":"A3MG7YZ06MX68N","asin":"B00004YWK2","style":null,"reviewerName":"Deanareno","reviewText":"I really like the removable lint screen that comes with the diverter. Makes it easy to clean and helps reduce any lint dust getting into the house. Well worth the money especially during cold winter months.","summary":"Nice for additional heat.","unixReviewTime":1484092800,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"01 15, 2017","reviewerID":"A38MHYWL7RBQO6","asin":"B00004YWK2","style":null,"reviewerName":"Nathaniel Moseley","reviewText":"This item does what it's intended for, and does it moderately well. It allows you to redirect the heat from your dryer into your home instead of the outside in the cold months. Unfortunately, there is a significant design flaw, which makes little sense to me. I'll get into that at the end.\n\nFirst, it's cheap. It's molded plastic that is folded in half to make a tube shape and fit the flapper inside the box. Unfortunately, mine doesn't fold completely and the natural stress in the plastic makes it slightly not circular. This isn't a problem for connecting tubing, but it is a problem for the flapper, as it doesn't seat fully in the outside-flowing tube, so it allows cold air in. Second on the cheap scale are the zip ties it comes with. They are a step up from your standard single-use zip ties, as they have a lever to unlatch and expand them. However, the lever is impossible to push without taking the whole thing off and getting a pair of pliers on both sides of the zip, so it's pointless. Use a standard metal worm clamp instead.\n\nThe lint trap is useless: Take a stocking or cut off pantyhose and fit it over the end instead of the lint filter, like you probably do on your washer outlet. It's a much better filter.\n\nNow to the biggest design flaw, which I can only partially try to explain: There is a hole in the flapper, with a small flimsy inner flapper covering it. The effect is that when the flapper is up, to redirect hot air into your home, much of it is still pushed outside. And when it is in the other position, moving air will pull it open and suck out inside air, and\/or push hot air into your home (I'm not sure which, as it's winter now and I don't want to test it right now). My only guess why this inner flapper exists at all is that it is to make up for the poorly closing main flapper, so you don't get stagnant moist air hanging out in the section between the \"heat keeper\" and your outside vent. The effect it has is that the heat keeper doesn't rully redirect air, is leaky, and forces you to mount it in one specific orientation, otherwise the inner flapper will hang open and let in outside air.\n\nTLDR: It works, but leaks and could be better, and unfortunately there doesn't seem to be a better option made anymore.","summary":"Functional, cheap (good and bad), seems to be only option available unfortunately","unixReviewTime":1484438400,"image":null}
{"overall":5,"vote":"2","verified":true,"reviewTime":"01 16, 2017","reviewerID":"ALNRBNT7WMHCQ","asin":"B00004YWK2","style":null,"reviewerName":"Keeya Judd","reviewText":"This works exactly as expected. Installation was quick and easy. The supplied clamps are useless, I used metal hose clamps. The heat keeper is pretty cheaply made but for 9 dollars my expectations were pretty low. In some of the reviews, users have commented on the little round flap in the larger flap that directs the air flow. It is a bypass door. It is a safety feature so when the screen gets plugged up, air can still vent. Under normal operation, my bypass door is closed or mostly closed directing the majority of the air into my house. Some reviews comment on the screen also. The screen openings are on the larger side, I would say it is like a window screen. Yes it does blow a tiny bit of lint into the room. My dryer is in the basement, so it doesn't really bother me. Overall I'm pleased with the heat keeper and would recommend it.","summary":"Cheap but does the job","unixReviewTime":1484524800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"01 23, 2017","reviewerID":"A370HU5Y7P5354","asin":"B00004YWK2","style":null,"reviewerName":"jamie ames","reviewText":"as expected","summary":"Five Stars","unixReviewTime":1485129600,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"01 30, 2017","reviewerID":"A1JDEW40HQHX0R","asin":"B00004YWK2","style":null,"reviewerName":"Harv","reviewText":"It was what I expected.","summary":"Four Stars","unixReviewTime":1485734400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"03 10, 2017","reviewerID":"A17109KS0DCTOG","asin":"B00004YWK2","style":null,"reviewerName":"roger erwin","reviewText":"It is a good .put the heat in my house when needed. And out when not needed.","summary":"It is a good. put the heat in my house when needed","unixReviewTime":1489104000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"03 13, 2017","reviewerID":"A2G1T9MVZLOHNG","asin":"B00004YWK2","style":null,"reviewerName":"Poodlehead","reviewText":"Works great!","summary":"Five Stars","unixReviewTime":1489363200,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"03 14, 2017","reviewerID":"AZ1F62XGI25RS","asin":"B00004YWK2","style":null,"reviewerName":"Jocivus lopez","reviewText":"This was just what I was looking for. The service and price were very good. It works great.","summary":"The service and price were very good. It works great","unixReviewTime":1489449600,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"06 6, 2017","reviewerID":"A2DHQKNGSYEHLS","asin":"B00004YWK2","style":null,"reviewerName":"Radek","reviewText":"The bands are quite useless.\nThe mesh is not fine enough","summary":"Three Stars","unixReviewTime":1496707200,"image":null}
{"overall":5,"vote":"30","verified":false,"reviewTime":"12 9, 2007","reviewerID":"A2UAX5WTHHKBBF","asin":"B00004YWK2","style":null,"reviewerName":"Mark S. Holden","reviewText":"This allows you to switch from venting your dryer outside in the summer to venting it inside for the heating season - with a fine screen lint trap for the inside outlet.\n\nIf you vent outside, you're throwing away moist warm air.\n\nThis is a dirt cheap way to save a little on your heating bill and get extra humidity in the air.\n\nThey're very easy to install.  And once it's in it'll last for years.\n\nYou'll probably save enough to pay for it at least once a year.","summary":"A wonderful idea.","unixReviewTime":1197158400,"image":null}
{"overall":4,"vote":"2","verified":true,"reviewTime":"12 24, 2016","reviewerID":"AJUJNCLKHWJD4","asin":"B00004YWK2","style":null,"reviewerName":"Rezin","reviewText":"I considered this a starting point. I assumed it would be flimsy based on other reviews but I ordered it anyway. When I got the item, I immediately reinforced it with duct tape, sealing  any potential leaks and reinforcing the ring part.\n\nI used hard ducting cut to size. The one end fit smoothly into the ducting, and I sealed it well with duct tape. For the other side I had an extra pipe joiner that was almost the perfect size. You can get these at Home Depot for about $6. It includes a rubber grommet that has a butt seal inside, a metal band and 2 integrated hose clamps. The two ends met seamlessly and there are zero air leaks.\n\nThe unit works great. And we have even run the dryer empty for supplemental heat.\n\nOnly complaint is the lint catch system could be a little better, but if it was too fine it would probably blocked much of the air flow, as we use a dryer sheet inside the air filter as well. We prefer to just clean a little lint off the floor from time to time for the enhanced heating.\n\nIf you know what you're doing, this is a great little starting point.","summary":"This is a great starting point","unixReviewTime":1482537600,"image":["https:\/\/images-na.ssl-images-amazon.com\/images\/I\/61de7fM-mKL._SY88.jpg"]}
{"overall":4,"vote":null,"verified":true,"reviewTime":"01 31, 2011","reviewerID":"A2XSOCG4FX5SP1","asin":"B00004YWK2","style":null,"reviewerName":"gaduff","reviewText":"The front screen is not quite fine enough to stop all of the lint from leaking through.  Stretch one nude knee high over the filter exit to act as a finer filter.  The nude shade makes it easier to see when the knee high needs to be cleaned or replaced.  It will trap the smallest of lint particles but not interfer with the exhaust flow.","summary":"Works fine but needs a slight modification","unixReviewTime":1296432000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"07 15, 2016","reviewerID":"APZQR34IVXV6Z","asin":"B00004YWK2","style":null,"reviewerName":"jess","reviewText":"Works great","summary":"Five Stars","unixReviewTime":1468540800,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"12 1, 2016","reviewerID":"A2DNTFTG3SMV6","asin":"B00004YWK2","style":null,"reviewerName":"Debby Schroll","reviewText":"Just what was needed.","summary":"Four Stars","unixReviewTime":1480550400,"image":null}
{"overall":2,"vote":null,"verified":true,"reviewTime":"01 26, 2011","reviewerID":"AOZPV58BLBOAM","asin":"B00004YWK2","style":null,"reviewerName":"Bob Rolls","reviewText":"This is a great idea that I have used before to good effect.\n\nUNFORTUNATELY...\n\nThis PARTICULAR device - essentially an air valve - is so poorly manufactured that it required repair BEFORE it could be used.  The plastic shell is a flimsy, two-piece, snap-together affair that didn't snap together well at all, thus leaving the interior valve flap in a warped shell that did not allow the valve flap to seat properly in either position.\n\nI repaired and modified mine so that it now works properly, but I remain annoyed that this product required pre-installation repair straight out of the box it came in.\n\nClamps provided are actually just plastic wire ties that are inadequate to hold dryer hoses under pressure.  Buy a real set of hose clamps to install this item and\/or use duct tape to keep the vent hoses in place.\n\nScreen is small and will rapidly become clogged with lint that gets through your dryer lint screen.  Install this device so that you can easily access its screen for removal and cleaning.\n\nI strongly suggest you purchase a different brand of this device.\n\nNOTE:  USE ONLY ON ELECTRIC DRYERS!","summary":"Good idea, inadequate design, very poorly manufactured","unixReviewTime":1296000000,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"01 21, 2011","reviewerID":"A3OTWPZD05CEBC","asin":"B00004YWK2","style":null,"reviewerName":"Scubajed","reviewText":"Your paying for the heat anyway - so why not heat your house.  For the price it does a great job - yes it is plastic, but what do you want for 8.50?  The screen does not capture all the lint and causes some dusting.  I fixed this by placing a cut to fit piece of cheese cloth on the outlet and covered with the screen.  When you feel the air flow diminish when your running your dryer, simply remove and clean the lint off the piece of cheese cloth and put back on the vent outlet and screen over top.  This is about every 6-8 loads of laundry.  No big deal - just like removing lint from your dryer screen.  I have not experienced any moisture issues that others have said.  I've been using this for two years now.\nWould definately recommend to friends.","summary":"Great at reducing the heat bill","unixReviewTime":1295568000,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"01 16, 2011","reviewerID":"A2KK7GOM4ER6B6","asin":"B00004YWK2","style":null,"reviewerName":"MgcShroomz","reviewText":"Works as described. As mentioned by other reviews, the so called \"zip ties\" DO NOT WORK. I have no idea how they are suppose to hold tension. Slapped some real zip ties on there and it's been holding up great. Screen isn't very fine and could use a better filter for the lint. I would recommend for the price if someone is trying to conserve some energy and recycle heat from the dryer back into your house.","summary":"Heat Keeper kit","unixReviewTime":1295136000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 30, 2010","reviewerID":"A1MPCN0WP5RNT7","asin":"B00004YWK2","style":null,"reviewerName":"Charles H. Stevenson","reviewText":"I am so please with the Heat Keeper I placed on our dryer.  Instead of heating the laundry room all the time, we now heat it while we dry clothes.  Wonderful product I highly recommend.","summary":"Heat Keeper really works!","unixReviewTime":1293667200,"image":null}
{"overall":2,"vote":"21","verified":false,"reviewTime":"12 12, 2010","reviewerID":"A2244ERTHEWGWA","asin":"B00004YWK2","style":null,"reviewerName":"Dryer hulk","reviewText":"I like the idea but the product is designed poorly, you get what you pay for on this one.  Could be useful if you can modify it yourself so it doesn't leak and so it will fit into standard size dryer hoses better.\n\nThis is a VERY cheaply made product, the inlet and outlet are too small to properly fit to 4'' aluminum flex duct or rigid duct...it will leak around the connection.  You may be able to get it to fit into one of those cheap aluminum foil flex ducts if you crank on the hose clamp really hard, but it will probably still leak.  Forget about using the 2 included clamps, they are basically just nylon zip ties.  When the valve is closed to vent outside, a good amount of air will still leak through the plastic flapper and vent inside your home...this will dump extra heat and humidity into your home in the summer when you want it to vent 100% outdoors. No gaskets or sealing valves on this, just cheap plastic...save your money.\n\nHome Depot and Lowes sell something similar. Theirs is just as cheap, however if you buy from a store you can at least return it easily without paying return shipping.","summary":"Very cheap and poorly built product, beter off making something yourself","unixReviewTime":1292112000,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"12 10, 2010","reviewerID":"A1WD2RP3E3GNE4","asin":"B00004YWK2","style":null,"reviewerName":".","reviewText":"This thing is a great invention. It warms my house when my heater can't keep up with the cold. My problem: 4 days after installation, the cheap little plastic hinge cam off. I duct taped it shut until I have time to take it all apart and reinstall it. Its ok to charge a little more and design it with PVC or a metal hinge to keep the trap door in place. I will be very happy with it after I modify it a little.","summary":"5 star idea. 3 star design","unixReviewTime":1291939200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 7, 2010","reviewerID":"A1HQDDFSSO9DXX","asin":"B00004YWK2","style":null,"reviewerName":"Jeremy A. Pettry","reviewText":"I found out about this item from a friend of mine who used to rent houses out to people.  My basement is not finished (yet), so i have no need to heat it.  Only problem is that the cold air makes its way to the first floor of the house and makes the floor cold.  So, this is the first winter we are using it.  It does a great job of heating the basement and makes the first floor warmer than usual.  Why heat your city when you can use that same heat to heat up your basement\/house.  Plus I love how you can take off the screen to clean it.  Also, the lever to send the heat outside during the summer.","summary":"Great Product Idea!","unixReviewTime":1291680000,"image":null}
{"overall":5,"vote":"7","verified":true,"reviewTime":"11 24, 2010","reviewerID":"A3IM2JACR52C9L","asin":"B00004YWK2","style":null,"reviewerName":"Maggie&#039;s Mom","reviewText":"Put this in the vent line combined with a flip lever vent for venting into the house in winter.  Works great, and filters about 90% of the lint missed by the dryer screen, which for us is a substantial amount.  We were constantly fighting decreased efficiency over time with lint lining the PVC tubing we tried instead of the less efficient flexible hose.  The screen on the flip vent catches the other 10% for a great system.  Even when we go to outside venting again in Summer, this will substantially reduce the number of times I have to clean the venting system each year.\n\nEasy to clean, durable screen.  Make sure the dryer is \"off\" before cleaning, or you will get a face full of lint.  Yeah, you're saying \"duh\" but if I hadn't told you, you'd have done it too eventually ;)  Great product.  Highly recommended.","summary":"Great product","unixReviewTime":1290556800,"image":null}
{"overall":5,"vote":"5","verified":true,"reviewTime":"11 20, 2010","reviewerID":"A1AP775QVO6GR","asin":"B00004YWK2","style":null,"reviewerName":"DoctorG","reviewText":"This device works great. Our laundry room was always quite chilly in the winter, what with the dryer vent letting in cold air, and it's on the north side of the house to boot. With the Heat Keeper, no more. This thing delivers as promised. It feels great when you're doing laundry in the winter now. Unlike some of the other comments, I think it provides just the right amount of humidity also, especially in the driest days of winter. (That may depend on where you live, though.) Furthermore, installation was a breeze. In fact, the one end fit right into the outside vent tightly; no clamp even necessary. For the end attached to the flexible vent pipe from the dryer, I just used the metal squeeze clamp I was already using, and so didn't bother with the plastic clamps included. Well worth the low price I paid.","summary":"Toasty warm!","unixReviewTime":1290211200,"image":null}
{"overall":4,"vote":"8","verified":true,"reviewTime":"03 21, 2010","reviewerID":"A4Q4DZYLJJXV2","asin":"B00004YWK2","style":null,"reviewerName":"A. Logan","reviewText":"Definitely helped raise the humidity in our house this winter. Our furnace sits in a closet with a louvered door open to the laundry room. When we ran this open with the dryer, we just switched the furnace blower ON to send it throughout the house. A digital hygrometer showed it raise the humidity one day from 16% to 45% with 2 loads of laundry. Worked perfectly. Made the house much more comfortable during dry winter.\n\nOnly reason I gave it 4 stars is you can't rely on the screen cover it comes with...it doesn't catch anything. A panty hose leg worked perfectly, just not so tasteful :P","summary":"Does what it's intended.","unixReviewTime":1269129600,"image":null}
{"overall":4,"vote":"11","verified":true,"reviewTime":"02 25, 2010","reviewerID":"A1H3SBUUQX9LF8","asin":"B00004YWK2","style":null,"reviewerName":"VaporTrail","reviewText":"We were getting bad smells in the laundry room.  Things that I thought:\nMildew from front load washer - we leave it open\ngas from sewer line - liquid fired the drain\ndead mouse in dryer vent - bought a vent that seals and prevents bugs and cold air\ngas coming from septic outside and coming in dryer vent - got this product\n\nThis lets me vent the warm hot air from the dryer into the house.  Our laundry is on the second floor and opens into a large part of the home\/stairwell.  So I am not worried at all about too much moisture and mildew but if you were in a tight place this might be and issue.\n\nPros: Works with modification.  I took some painter's tape and sealed the cracks and gaps this unit has.\n\nCons:\nLever is on the wrong side for our layout.  Sort of a pain but since I'll only switch once or twice a year not a big deal.\nFilter is worthless - I put on one of my wifes nylon tube socks and this does the trick perfectly - (NOTE you will have to clean out the sock to keep the dryer drying)\n\nWith my mods I am pleased with this purchase.","summary":"Works","unixReviewTime":1267056000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 3, 2016","reviewerID":"A1MOCOOVT406R4","asin":"B00004YWK2","style":null,"reviewerName":"Dean H.","reviewText":"Hook up was easy and works just fine.","summary":"Heat saver close dryer.","unixReviewTime":1480723200,"image":null}
{"overall":4,"vote":"3","verified":true,"reviewTime":"01 31, 2010","reviewerID":"ACOSSB946YQ7K","asin":"B00004YWK2","style":null,"reviewerName":"MD1","reviewText":"Sent quickly. Saves energy. Recycles heat. Good product. Would be better with a finer screen.","summary":"Sent quickly. Saves energy. Good product.","unixReviewTime":1264896000,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"12 24, 2009","reviewerID":"A25W2RIQ6K0OAT","asin":"B00004YWK2","style":null,"reviewerName":"The gardener","reviewText":"I had been trying to get the heat that was being pumped outside to stay inside during the winter.  Now I have this easy to install device.  Yeah!","summary":"Good green idea","unixReviewTime":1261612800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 19, 2009","reviewerID":"A2UDM9NG07QY2U","asin":"B00004YWK2","style":null,"reviewerName":"AnnB","reviewText":"Easy install. Laundry is in unheated basement and dryer venting is behind and routed up to just above ground level. I liked that it nearly instantly made the otherwise unheated room less chilly to restart a load of laundry and tidy up. The day I installed it the outside temperature was about 30 degrees F.\nThe moisture is a plus to combat dry winter air.\nAlso keeps some of the cold winter air from dropping back into the basement through the venting.","summary":"warms the basement on laundry day in the winter","unixReviewTime":1261180800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"11 5, 2009","reviewerID":"AV6BE8FQMCKF2","asin":"B00004YWK2","style":null,"reviewerName":"xplornevada","reviewText":"My washer and dryer are in the garage, so it's great to be able to capture the dryer's wasted heat during the winter. Additionally, this helps add some humidity to the house, which tends to be dry because we live in the desert. The screen on the heat keeper catches any lint that escapes the dryer filter.\nI installed mine in about 10 minutes\nThe only down side is that the garage smells a little like laundry soap and dryer sheets, but I suppose that could be a plus for most garages.","summary":"I don't know why these aren't more popular . . .","unixReviewTime":1257379200,"image":null}
{"overall":5,"vote":"15","verified":true,"reviewTime":"06 18, 2009","reviewerID":"A2DZO8MWVM4WKD","asin":"B00004YWK2","style":null,"reviewerName":"Hekkenschtze","reviewText":"Well if you have an electric dryer, this is the best way!  In the winter you just turn the valve to shut off the hotair's route to the outside, yet to turn that hotair into your house.\n\nIt works, it really does and it provides a \"wet\" heat that smells like fresh linen (go figure, right?) instead of that \"dry\" heat that dries you out.\n\nWell worth the money for the sweet smelling \"wet\" heat that it adds to your home.","summary":"Wanna save some money in the winter?","unixReviewTime":1245283200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"01 28, 2009","reviewerID":"A3QG8R4G8LDTEE","asin":"B00004YWK2","style":null,"reviewerName":"Rustic","reviewText":"This works well to heat my basement in the winter....I have a workshop in my basement that I spend alot of time in.  So now when I do my laundry, it warms the area up quite nicely.","summary":"Great product!","unixReviewTime":1233100800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"12 17, 2013","reviewerID":"A2WGQWI7ZWFMRO","asin":"B00004YWK2","style":null,"reviewerName":"Cookie, Olive, Sadie, Stella","reviewText":"I bought this to replace one that I bought at a home improvement store. The screen cover was square in shape would often be difficult to re-attach once I removed it to clean the screen.  This one is round and it just pops off easily, nothing to line up.  This one also appears to be much sturdier and for me will be easier to install.","summary":"Better than types carried in home improvement stores.","unixReviewTime":1387238400,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"11 21, 2008","reviewerID":"A101BOECUT4QS4","asin":"B00004YWK2","style":null,"reviewerName":"M R ATL","reviewText":"I used one of these type of splitters years ago at a different house - been wanting another one for a while.  This one seems to be a bit nicer than the one I had before.  I have only had it a couple of months but it seems to work well - I would recommend it.","summary":"Does what I want it to","unixReviewTime":1227225600,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"09 30, 2016","reviewerID":"A1EZRX9PAEW4L6","asin":"B00004YWK2","style":null,"reviewerName":"Jeremy","reviewText":"Great for basement washroom. It does leak air in the normal operating position, but not enough to worry about. I did add a piece of electrostatic air filter to collect the fiber particles this lets pass.","summary":"Works good but not perfect.id recommend for basement washroom.","unixReviewTime":1475193600,"image":null}
{"overall":5,"vote":null,"verified":false,"reviewTime":"10 16, 2016","reviewerID":"A1M69NRKJA3SJO","asin":"B00004YWK2","style":null,"reviewerName":"monleigh","reviewText":"This has been going strong for a few winters now.  Really helps heat up the basement on those really cold NJ days.","summary":"A great invention. LOVE IT","unixReviewTime":1476576000,"image":null}
{"overall":3,"vote":null,"verified":true,"reviewTime":"11 7, 2016","reviewerID":"ARN8PNPHTO5VQ","asin":"B00004YWK2","style":null,"reviewerName":"J&amp;J","reviewText":"Its definitely smaller then the picture makes it appear. Which is good in a small space. It doesn't really have what I would call a lint guard its basically metal window screen. For the price its a good base to modify and make what you need.","summary":"meh","unixReviewTime":1478476800,"image":null}
{"overall":1,"vote":null,"verified":true,"reviewTime":"11 30, 2016","reviewerID":"A3USRRBMKQ4TX1","asin":"B00004YWK2","style":null,"reviewerName":"Chuck","reviewText":"Very cheaply made! To make this thing work properly you will need to seall all the seams and find a way to prevent lint from coming through the coarse screen. I used plastic glue to pull the seams together. I used caulk to seal the seams. I am usingredients used dryer sheets under the screen to prevent lint from escaping. This exact vent can be purchased at Menards for $5.","summary":"Over priced poor quality","unixReviewTime":1480464000,"image":null}
{"overall":3,"vote":"5","verified":false,"reviewTime":"01 23, 2010","reviewerID":"AGLUG87SLGW3Y","asin":"B00004YWK2","style":null,"reviewerName":"Cord cover maven","reviewText":"Gas dryers give off carbon monoxide.  Using this device on one would let carbon monoxide into your house, and could be deadly.  Irresponsible not to mention this upfront in bold print!","summary":"WARNING - Not for gas dryers!","unixReviewTime":1264204800,"image":null}
{"overall":1,"vote":null,"verified":true,"reviewTime":"12 22, 2013","reviewerID":"A3SQKDAQWQCPVA","asin":"B00004YWK2","style":null,"reviewerName":"chris thompson","reviewText":"The clamps are hardly clamps there just zipties. And it did not come with any kind of filter or screen like it said it would.... but the shipping was quick.","summary":"heat keeper","unixReviewTime":1387670400,"image":null}
{"overall":2,"vote":null,"verified":true,"reviewTime":"06 15, 2016","reviewerID":"A1YFOFB03DCCFZ","asin":"B00004YWK2","style":null,"reviewerName":"L. Eilander","reviewText":"Not wow-ing me.  The product is flimsy, with gaps between the plastic halves.\n\nWorse, there is NO SEAL around the flapper on any side.  In summer you will still get some dryer air inside, and in any season you will get outside air and bugs in through the valve.\n\nStill trying to decide if I even want to install this or send it back.","summary":"Cheaply made with NO SEAL!","unixReviewTime":1465948800,"image":null}
{"overall":4,"vote":"2","verified":true,"reviewTime":"12 27, 2013","reviewerID":"A2AE8D96OG49C3","asin":"B00004YWK2","style":null,"reviewerName":"El__Quijote","reviewText":"First of all, let me start by sayin that this Heat Keeper might not be for everyone.  It all depends on your type of drier, your home's layout and your geographical location.\nPlease do yourself a favor and follow the safety instructions.  DO  NOT USE WITH A GAS DRYER!!!\n\nWe are currently using this in a small rental home with a crappy heater that dries the already dry New Mexico winter air.  It was a no-brainer to use the warm, moist air into the house to help heat it and increase the humidity to comfortable levels.\n\nIt is the first unit that we've ever purchased and I really don't regret it at all.\nThis unit is extremely flimsy and falling apart when you receive it.  However, it does not necessarily detract from its usefulness since, once installed, it is sturdy enough to not fall apart.  We haven't had any issues with it.\nThe vent in this house is already an exposed pipe going through the laundry room and is held up by brackets, I just made sure that this unit was next to one of the brackets and added a second one.  However, if it had it's own way of being held up, it would be much better.\nAlso, the two clamps that are included in the \"kit\" are a joke and should just be tossed.  Get yourself a couple of metal clamps that you can adjust better with a screwdriver and you'll thank yourself later.\nThe round lint trap is easy to pull on and off, an important feature due to the fact that the mesh is not fine enough to use as is and plenty of lint escapes into the house.\nWe actually like the filter mesh the way it is right now better because we only use it as a \"filter holder.\"\n- In the winter, we take off the round lint trap, put a used dryer sheet over the hole and hold it in place with the lint trap.  This holds it in place while in use.  Once the clothes are dry, we pull the lint covered dryer sheet off and replace it with the new one coming out of the dryer.  It is the easiest way to keep the lint trap clean, the dryer sheet catches the perfect amount of lint while letting the hot moist air in, and it only it takes seconds to replace with the next one, which the dryer supplies for you.\n- In the summer, we take off the round lint trap, put a piece of a cardboard but to the size of the trap, and hold it in place with the lint trap.  This is absolutely necessary, otherwise, you will still get hot moist air coming into your home in the heat of the summer.  Yes, the flap is not perfect, but who cares, it is good enough for us.","summary":"Perfect for me, with a couple of modifications...","unixReviewTime":1388102400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"06 23, 2015","reviewerID":"A160Y8BJWHYOER","asin":"B00004YWK2","style":null,"reviewerName":"Bob Carter","reviewText":"Worked like it was suppose to and made great energy savings in the winter.  Setting it up again this winter and looking forward to the savings.  As dry as our home gets from a fireplace and central heating, the warm air and moisture this puts into our home isn't a problem.  The lint trap is easy to clean and setup is easy for anyone used to putting on a dryer vent.  You do have to figure out a way to hang it up to blow the warm air cleanly and easily into your open room otherwise the humidity would obviously become a problem in a small or tight enclosed space.  But, in an open room? This thing is great!","summary":"Thanks Dundas Jafine! :)","unixReviewTime":1435017600,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"06 23, 2015","reviewerID":"A2JF3Q95DMVC8I","asin":"B00004YWK2","style":null,"reviewerName":"showmegrad","reviewText":"works fine for winter, but lets a good deal of heat & moisture in the basement in summer","summary":"Four Stars","unixReviewTime":1435017600,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"06 26, 2015","reviewerID":"A3BXP2INWAWLNN","asin":"B00004YWK2","style":null,"reviewerName":"DMac","reviewText":"It works as advertised.  Only longer term usage will determine whether the air-flow flapper stays in the desired position *and* prevents air leakage around the perimeter, i.e. seals well enough that hot air during use doesn't come inside when in the bypass position, nor continues to the outside when directed to the indoors position, which is what happened to the previous one we had from a different manufacturer.","summary":"It works as advertised. Only longer term usage will ...","unixReviewTime":1435276800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"07 5, 2015","reviewerID":"A3NFA6HF5LLYT","asin":"B00004YWK2","style":null,"reviewerName":"Dtoff1","reviewText":"Saves me $$$$$$-----Love it!","summary":"Five Stars","unixReviewTime":1436054400,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"07 14, 2015","reviewerID":"A5POJ3A2LVFB1","asin":"B00004YWK2","style":null,"reviewerName":"Becky","reviewText":"For the money it was good","summary":"Four Stars","unixReviewTime":1436832000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"07 15, 2015","reviewerID":"A1FZ28AXBUF6B1","asin":"B00004YWK2","style":null,"reviewerName":"JM","reviewText":"Great vent.  I'm a humidity connoisseur and the house was at 15% constantly.  After adding this and doing a few loads of laundry, the whole house was at 50% for quite a while.  I realize now that the screen comes right off so you can vac any lint out - easy to clean.  Happy with this product.","summary":"Easy to clean, easy to install, and easy to make a LOT of humidity in your house, quickly!","unixReviewTime":1436918400,"image":null}
{"overall":4,"vote":null,"verified":false,"reviewTime":"07 20, 2015","reviewerID":"A22DX9XOT1CUQ5","asin":"B00004YWK2","style":null,"reviewerName":"marie stoves","reviewText":"I am actually glad to have found this.  Years ago we had a similar thing in Navy housing.  In the winter it was wonderful to have that extra heat from the dryer.  In the summer, we just vented it outside.  We just ordered this for our house.","summary":"I am actually glad to have found this","unixReviewTime":1437350400,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"08 22, 2015","reviewerID":"A1F0C0KIYPL47X","asin":"B00004YWK2","style":null,"reviewerName":"norman bedillion","reviewText":"Works well. Adds some warmth and humidity the basement in the winter.","summary":"Four Stars","unixReviewTime":1440201600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"08 23, 2015","reviewerID":"A1Y4KUBA7V4D7W","asin":"B00004YWK2","style":null,"reviewerName":"Alan","reviewText":"Great and easy to use","summary":"Exactly what I wanted","unixReviewTime":1440288000,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"09 1, 2015","reviewerID":"A27X1VISTUJ5TB","asin":"B00004YWK2","style":null,"reviewerName":"Redline7","reviewText":"excellent  saved us a lot of electricity heating when we diverted it into the condo in the winter","summary":"excellent saved us a lot of electricity heating when we ...","unixReviewTime":1441065600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"09 10, 2015","reviewerID":"A3B8RHP44EO9QB","asin":"B00004YWK2","style":null,"reviewerName":"RLY","reviewText":"This clever but inexpensive attachment is great if your laundry room is in the basement! Switches the heat to vent it indoors, with a screen for lint catching. Some finer forms of lint may pass through, but you can always attach another screen to catch more lint. Easy to install.","summary":"Why waste dryer heat in the winter?","unixReviewTime":1441843200,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"09 17, 2015","reviewerID":"A1HK3NTFR9WWUB","asin":"B00004YWK2","style":null,"reviewerName":"JHODER","reviewText":"works great easy hook uparrived on time. would purchase again.","summary":"Five Stars","unixReviewTime":1442448000,"image":null}
{"overall":4,"vote":null,"verified":true,"reviewTime":"09 23, 2015","reviewerID":"A3R5NAWSQQS9AS","asin":"B00004YWK2","style":null,"reviewerName":"Douglas W.","reviewText":"Good unit","summary":"Four Stars","unixReviewTime":1442966400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"10 1, 2015","reviewerID":"A1FQ5PQ5C7XVSK","asin":"B00004YWK2","style":null,"reviewerName":"TheFitz","reviewText":"Shopped at several local stores and they mostly looked at me as if I was an idiot. Even 'older' sales persons didn't know what I was talking about. Duh.\n I have used these for over 35 years and this one works just fine.","summary":"Time to VENT !","unixReviewTime":1443657600,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"10 23, 2015","reviewerID":"A177DKAQC9MKW2","asin":"B00004YWK2","style":null,"reviewerName":"eburgguy","reviewText":"It works!","summary":"Five Stars","unixReviewTime":1445558400,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"06 21, 2015","reviewerID":"A144SNMRKANIQA","asin":"B00004YWK2","style":null,"reviewerName":"Lillian Keller","reviewText":"Works good. Not hard to set up or use.","summary":"Five Stars","unixReviewTime":1434844800,"image":null}
{"overall":5,"vote":null,"verified":true,"reviewTime":"10 30, 2015","reviewerID":"A21YS2PSI5APWP","asin":"B00004YWK2","style":null,"reviewerName":"DLBise","reviewText":"Sweet way to keep heat in the garage when drying clothes in the winter, great way to direct it out in the summer.","summary":"Excellent Heat Saver","unixReviewTime":1446163200,"image":null}