{"overall":5,"reviewText":"Not one thing in this book seemed an obvious original thought. However, the clarity with which this author explains how innovation happens is remarkable.\n\nAlan Gregerman discusses the meaning of human interactions and the kinds of situations that tend to inspire original and\/or clear thinking that leads to innovation. These things include how people communicate in certain situations such as when they are outside of their normal patterns.\n\nGregerman identifies the ingredients that make innovation more likely. This includes people being compelled to interact when they normally wouldn't, leading to serendipity. Sometimes the phenomenon will occur through collaboration, and sometimes by chance such as when an individual is away from home on travel.\n\nI recommend this book for its common sense, its truth and the apparent mastery of the subject by the author."}
{"overall":3,"reviewText":"In  this engaging, readable book, author Gregrerman argues that business and personal growth come when we are open to interacting with strangers. This advice isn't especially new; as the author notes, Granovetter's concept of \"weak ties\" has become familiar. However much I wanted to like this book, I found it hard to identify insights that were truly new and novel and the recommendations, in some cases, impractical.\n\nFor instance, on page 26, the author suggests tips to create a plan for success. It's pretty standard: set an objective, develop a plan and so on. One step, \"Find strangers to fill those [knowledge] gaps,\" makes a lot of sense; it's the essential premise of networking. But these days, getting strangers to share information requires fairly sophisticated networking skills.\n\nWhile the book's premise relates to the importance of strangers, a good part of content is about overcoming resistance to people who might seem to have nothing to teach us. The issue here doesn't seem to be about strangers but about topics related to stereotyping and false appearance. It's important to differentiate true strangers from those we meet in a familiar setting that confers credibility.\n\nAdditionally, the people who gain most from dealing with strangers tend to transform the relationship so they're now dealing with friends and personal acquaintances. The stranger factor disappears! For instance, the author describes a meeting with a university administrator who becomes a mentor and advocate. Although the two were strangers initially, they met in a fairly structured situation that was conducive to creating a relationship, and at some early point they stopped being strangers\n\nPerhaps our real challenge is not about breaking down barriers with strangers, but deciding which strangers to approach and how to assess their input. Career changers are urged to seek help from experts in their industry, yet often the \"advice\" they get is inappropriate; however, these people can be valuable as informational resources when approached with carefully designed questions.\n\nIn the end, the stranger question becomes both simple and complex. Yes, we will grow by interacting with diverse people who are outside our inner circles. However, sometimes resistance to strangers can help us avoid traps, especially when we're paying or placing ourselves in a vulnerable position.\n\nFor instance, the author says he met his wife by connecting with strangers in a particularly clever way - offering a big reward to friends who'd set up an introduction. Sure, these women were strangers, but they were already connected through his own friends, creating an effective filter.\n\nThe toolkit at the book's end includes some useful but not entirely novel ideas. In my experience the best way to meet new people in a meaningful is to engage in some new activity. His idea to \"get out of the office\" is a good start, but what about joining a new gym or a new club, trying new networking events, or even taking a class that brings you in contact with people you wouldn't meet otherwise?\n\nOverall the book entertains.  You might have some interesting conversations and talking points when you share the examples But the title leads us to expect something that radically shifts our mindset ... sort of like what happens when we connect with strangers."}
{"overall":5,"reviewText":"Very thought provoking. Hits the nail on the head when I look at my own experiences with strangers on airlines, etc. Most of these encounters have been very educational giving me insights I would never have realized. I work with a non-profit organization that continues to benefit from international exposure resulting from a meeting with a reporter while on an airliner.  I would strongly recommend this book to anyone. The fact that I depend on reviews, like this one, to help with my purchases makes his point!\nD.Kammer"}
{"overall":5,"reviewText":"The insights this book provides are remarkable -- Gregerman delivers actionable advice concisely with a clear, even playful prose. His observations on the importance of spontaneity are thought-provoking and remind me of other books like \"Anti-Fragile.\"\n\nOverall, a short but information-packed read! Definitely recommend."}
{"overall":4,"reviewText":"When I first read through The Necessity of Strangers, it seemed to tell the same old stories about innovation that you see told over and over again. Yet another consultant out there making money telling clients to do this and do that to improve their business, where almost any action will help. Not much unique or valuable about those kinds of consultants.\n\nSo after skimming a few chapters I put the book on my unread books pile for a while and moved on to other books. When I picked the book up later, though, I was more impressed. I tried some of the practical suggestions Alan Gregerman gives at the end of his chapters, and they seemed to work. They were more than just gimmicks, but helpful tools.\n\nThat said, I'm still not sure which book most readers will experience. The trite rehash or the helpful guidance. Perhaps it's worth reading the book to find out."}
{"overall":5,"reviewText":"As children, we were all warned against strangers.  Some of us carried that feat and distrust of people we haven't been introduced to into adulthood.  As business people, this fear and distrust now works against us.  We need to be more open to what we hear from all sources.\n\nWell, Alan Gregeman himself is a stranger to me, but he sure makes sense in his book.  Our friends make up an insignificant percentage of the world's poulation so closing our ears to strangers is closing ourselves to most of the world.\n\nThis book makes lots of sense.  Gregeman in a conversational, rather than academic, tone illustrates the value these \"strangers\" hold for us.\n\nThis is a book that will open your eyes, ears, and heart to new perspectives and perceptions.  This is a book for all of us and although I'm a stranger to most of you, heed my advice and read this book.  Trust me."}
{"overall":5,"reviewText":"Dr. Gregerman presents an important message for leaders in a range of organizations in an entertaining, motivating format. He forces the reader to challenge basic assumptions about how we develop networks and how to prioritize relationships. It's a great read for those interested in topics from change management to innovation."}
{"overall":5,"reviewText":"I like business books that approach topics and issues  (even if they are obvious topics and issues) from a new perspective.  This book specifically addresses the need for us to overcome our natural, built-in aversion to dealing with \"strangers.\"  The books spends a lot of time demonstrating that this aversion is something that is part of the human make-up, and then shows how this aversion hinders our innovation, creativity, collaboration,  and ability to lead.  I read two or three business books per month, and none of them have yet addressed this interesting point of view in quite this way.  It seems like an obvious point, but this book really made me think about how to engage with \"strangers\" and I actually now find myself seeking out others and engaging in better conversation.  At a conference I recently went to, I actually found myself making an effort to meet other vendors to learn more deeply about what they do.  When we do this, we expand our horizons, get out of our limited point of view, and can innovate and lead better.  So, I gave the book five stars for presenting a new approach to something \"obvious\" and making a difference in the way I approach business.  I knocked it one star for being way too lengthy in some places (a typical business book problem these days).  But I gave it one star back for providing a \"Toolkit\" at the end of the book to help the reader apply the principles presented throughout the book.  This is a great idea and I wish every business book did this.  So, did I learn something? Yes.  Is it something I can apply that will make a difference? Yes.  Did I find a few \"a-ha!\" moments and did I find myself highlighting and taking notes?  Yes.  This is a business book that I can highly recommend."}
{"overall":3,"reviewText":"In a breezy, conversational book, Gregrerman implores the reader that a \"growth\" mindset predicted on recognizing the gaps in one's personal\/business plans and the willingness to reach out to strangers to learn from and fill that gap - is a dependable way to innovate\/grow.  For a book that is billed as \"counterintuitive\" and \"provocative\", that advise may seems fairly formulaic.  Nevertheless, the ample use of anecdotes and some personal experiences are used to illustrate some simple (to understand, at least) techniques that can reduce one's reluctance to reach out and collaborate with \"strangers\".  The message is elegant, simple, and can be quite useful - one wishes that the editing was a little stricter (with about 200 pages, the message is amplified many times in the book) and more careful in some of the recommendations (some brilliant ones related to orientation of new hires get mixed with not-so-great ones regarding promotions).  With ample references to other pop psych books on incentives, motivation and leadership, Gregerman provides a potentially powerful message to reframe one's approach on growth."}
{"overall":5,"reviewText":"I had zero expectations of Alan Gregerman's \"The Necessity of Strangers.\" In fact, I forgot that I got it until it arrived and I probably would have set it aside except that I read the book flap and was intrigued again.\n\nI'm a creature of habit but Gregerman's theorizes (successfully) that it isn't the team you know but perhaps the constructive team that you don't know that pushes individuals and businesses towards innovation.\n\nAfter reading this very concise and well laid out book, I'm inclined to agree when I think of my own work history. It was when there was a constant flow of 'strangers' that I stayed on my toes and my mind was sharp.\n\nBeing in the 'back' now, I'm not as exposed to clients, internal or external, so this book is actually very timely for me.\n\nGregerman organizes the book into 3 parts. The first is Framework that explains why we need 'strangers' and the second part is 'Practice' in how it can work and it makes up the bulk of the book. The final part is Possibilities which is almost superfluous compared to the previous parts but it was like a reward of sorts.\n\nVery well done."}